<?php

return [
    'nav_title' => 'التوصيلات',
    'model_label' => 'التوصيل',
    'model_label_plural' => 'التوصيلات',
    'name' => 'الاسم',
    'name_help' => 'اسم فريد يستخدم لتمييز هذا التوصيل عن غيره.',
    'source' => 'المصدر',
    'source_help' => 'مسار الملف في نظام المضيف ليتم توصيله بالحاوية.',
    'target' => 'الهدف',
    'target_help' => 'المكان الذي سيكون فيه التوصيل متاحًا داخل الحاوية.',
    'read_only' => 'للقراءة فقط؟',
    'read_only_help' => 'هل التوصيل للقراءة فقط داخل الحاوية؟',
    'description' => 'الوصف',
    'description_help' => 'وصف تفصيلي لهذا التوصيل',
    'no_mounts' => 'لا توجد توصيلات',
    'eggs' => 'البيوض',
    'nodes' => 'العقد',
    'toggles' => [
        'writable' => 'قابل للكتابة',
        'read_only' => 'للقراءة فقط',
    ],
    'table' => [
        'name' => 'الاسم',
        'all_eggs' => 'جميع البيض',
        'all_nodes' => 'جميع العقد',
        'read_only' => 'للقراءة فقط',
    ],
];
