<?php

return [
    'nav_title' => 'المستخدمون',
    'model_label' => 'المستخدم',
    'model_label_plural' => 'المستخدمون',
    'self_delete' => 'لا يمكنك حذف نفسك',
    'has_servers' => 'المستخدم يمتلك خوادم',
    'email' => 'البريد الإلكتروني',
    'username' => 'اسم المستخدم',
    'password' => 'كلمة المرور',
    'password_help' => 'إدخال كلمة المرور للمستخدم اختياري. سيتلقى المستخدم الجديد بريدًا إلكترونيًا يطلب منه إنشاء كلمة مرور عند تسجيل الدخول لأول مرة.',
    'admin_roles' => 'أدوار المسؤول',
    'roles' => 'الأدوار',
    'no_roles' => 'لا توجد أدوار',
    'servers' => 'الخوادم',
    'subusers' => 'المستخدمون الفرعيون',
];
