<?php

return [
    'validation' => [
        'fqdn_not_resolvable' => 'FQDN หรือที่อยู่ IP ที่ระบุไม่สามารถติดต่อได้หรือที่อยู่ IP ที่ถูกต้อง',
        'fqdn_required_for_ssl' => 'สำหรับการใช้ SSL กับโหนดนี้ จำเป็นต้องมีชื่อโดเมนที่ระบุอย่างเต็มรูปแบบซึ่งสามารถแปลเป็นที่อยู่ IP สาธารณะ',
    ],
    'notices' => [
        'allocations_added' => 'เพิ่มพอร์ตไปยังโหนดนี้สำเร็จแล้ว',
        'node_deleted' => 'โหนดถูกลบออกจากแผงเรียบร้อยแล้ว',
        'node_created' => 'สร้างโหนดใหม่สำเร็จ คุณสามารถกำหนดค่าเดมอนบนเครื่องนี้โดยอัตโนมัติได้โดยไปที่แท็บ "การกำหนดค่า" <strong>ก่อนที่คุณจะสามารถเพิ่มเซิร์ฟเวอร์ใดๆ คุณต้องจัดที่อยู่ IP และพอร์ตอย่างน้อยหนึ่งรายการก่อน</strong>',
        'node_updated' => 'ข้อมูลโหนดได้รับการอัปเดตแล้ว หากมีการเปลี่ยนแปลงการตั้งค่าเดมอน คุณจะต้องรีบูตเพื่อให้การเปลี่ยนแปลงมีผล',
        'unallocated_deleted' => 'ลบพอร์ตที่ไม่ได้จัดสรรทั้งหมดสำหรับ <code>:ip</code>',
    ],
];
