<?php

return [
    'validation' => [
        'fqdn_not_resolvable' => 'FQDN หรือที่อยู่ IP ที่ระบุไม่สามารถติดต่อได้หรือที่อยู่ IP ที่ถูกต้อง',
        'fqdn_required_for_ssl' => 'จำเป็นต้องมีชื่อโดเมนที่ระบุอย่างครบถ้วน ซึ่งสามารถแปลเป็นที่อยู่ IP สาธารณะเพื่อที่จะใช้ SSL สำหรับ Node นี้',
    ],
    'notices' => [
        'allocations_added' => 'เพิ่มพอร์ตไปยัง Node นี้สำเร็จแล้ว',
        'node_deleted' => 'Node ถูกลบออกจากแผงเรียบร้อยแล้ว',
        'node_created' => 'สร้าง Node ใหม่สำเร็จ คุณสามารถกำหนดค่า daemon บนเครื่องนี้โดยอัตโนมัติได้โดยไปที่แท็บ "การกำหนดค่า" <strong>ก่อนที่คุณจะสามารถเพิ่มเซิร์ฟเวอร์ใดๆ คุณต้องจัดที่อยู่ IP และพอร์ตอย่างน้อยหนึ่งรายการก่อน</strong>',
        'node_updated' => 'ข้อมูล Node ได้รับการอัปเดตแล้ว หากมีการเปลี่ยนแปลงการตั้งค่า daemon คุณจะต้องรีบูตเพื่อให้การเปลี่ยนแปลงมีผล',
        'unallocated_deleted' => 'ลบพอร์ตที่ไม่ได้จัดสรรทั้งหมดสำหรับ <code>:ip</code>',
    ],
];
