<?php

return [
    'user' => [
        'search_users' => 'Введіть ім\'я, ID Користувача або адресу електронної пошти',
        'select_search_user' => 'ID користувача, який потрібно видалити (Введіть \'0\' для повторного пошуку)',
        'deleted' => 'Користувача успішно видалено з панелі.',
        'confirm_delete' => 'Ви впевнені, що хочете видалити цього користувача з панелі?',
        'no_users_found' => 'Користувачів за вказаним пошуковим запитом не знайдено.',
        'multiple_found' => 'Знайдено кілька облікових записів для вказаного користувача, неможливо видалити користувача через параметр --no-interaction.',
        'ask_admin' => 'Цей користувач є адміністратором?',
        'ask_email' => 'Адреса електронної пошти',
        'ask_username' => 'Ім\'я користувача',
        'ask_password' => 'Пароль',
        'ask_password_tip' => 'Якщо ви хочете створити обліковий запис с випадковим паролем та надіслати його до користувача, повторно запустіть цю команду (CTRL+C) з прапорцем \'--no-password\'.',
        'ask_password_help' => 'Пароль має містити принаймні 8 символів та містити хоча б одну велику літеру та цифру.',
        '2fa_help_text' => 'Ця команда вимкне 2-факторну автентифікацію для облікового запису користувача, якщо її ввімкнено. Цю команду слід використовувати лише як команду відновлення облікового запису, якщо користувач заблоковано доступ до свого облікового запису. Якщо це не те, що ви хотіли зробити, натисніть CTRL+C, щоб вийти з цього процесу.',
        '2fa_disabled' => 'Двофакторна аутентифікація була вимкнена для: email.',
    ],
    'schedule' => [
        'output_line' => 'Виконання завдання для першого процесу у `:schedule` (:id).',
    ],
    'maintenance' => [
        'deleting_service_backup' => 'Видалення файлу резервної копії служби :file.',
    ],
    'server' => [
        'rebuild_failed' => 'Помилка при запиті на перебудову сервера ":name" (#:id) на вузлі ":node": :message',
        'reinstall' => [
            'failed' => 'Помилка при запиті на перевстановлення сервера ":name" (#:id) на вузлі ":node": :message',
            'confirm' => 'Ви збираєтеся перевстановити групу серверів. Бажаєте продовжити?',
        ],
        'power' => [
            'confirm' => 'Ви збираєтеся виконати :action для :count серверів. Бажаєте продовжити?',
            'action_failed' => 'Помилка при виконанні команди живлення для ":name" (#:id) на вузлі ":node": :message',
        ],
    ],
    'environment' => [
        'mail' => [
            'ask_smtp_host' => 'SMTP хост (наприклад, smtp.gmail.com)',
            'ask_smtp_port' => 'SMTP порт',
            'ask_smtp_username' => 'SMTP-ім\'я користувача',
            'ask_smtp_password' => 'SMTP пароль',
            'ask_mailgun_domain' => 'Домен Mailgun',
            'ask_mailgun_endpoint' => 'Кінцева точка Mailgun',
            'ask_mailgun_secret' => 'Секретний ключ Mailgun',
            'ask_mandrill_secret' => 'Секретний ключ Mandrill',
            'ask_postmark_username' => 'API-ключ Postmark',
            'ask_driver' => 'Який драйвер слід використовувати для відправки електронної пошти?',
            'ask_mail_from' => 'Адреса електронної пошти відправника',
            'ask_mail_name' => 'Ім\'я відправника',
            'ask_encryption' => 'Метод шифрування для використання',
        ],
    ],
];
