<?php

return [
    'nav_title' => 'उपयोगकर्ताओं',
    'model_label' => 'उपयोगकर्ता',
    'model_label_plural' => 'उपयोगकर्ताओं',
    'self_delete' => 'अपने आप को हटा नहीं सकते',
    'has_servers' => 'उपयोगकर्ता के पास सर्वर हैं',
    'email' => 'ईमेल',
    'username' => 'उपयोगकर्ता नाम',
    'password' => 'पासवर्ड',
    'password_help' => 'उपयोगकर्ता पासवर्ड प्रदान करना वैकल्पिक है। नया उपयोगकर्ता ईमेल उपयोगकर्ताओं को पहली बार लॉगिन करने पर पासवर्ड बनाने के लिए प्रेरित करेगा।',
    'admin_roles' => 'व्यवस्थापक भूमिकाएँ',
    'roles' => 'भूमिकाएँ',
    'no_roles' => 'कोई भूमिका नहीं',
    'servers' => 'सर्वर्स',
    'subusers' => 'उपउपयोगकर्ता',
];
