<?php

return [
    'nav_title' => 'مضيفو قواعد البيانات',
    'model_label' => 'مضيف قاعدة بيانات',
    'model_label_plural' => 'مضيفو قواعد البيانات',
    'table' => [
        'database' => 'قاعدة البيانات',
        'name' => 'الاسم',
        'host' => 'المضيف',
        'port' => 'المنفذ',
        'name_helper' => 'ترك هذا الحقل فارغًا سيؤدي إلى إنشاء اسم عشوائي تلقائيًا',
        'username' => 'اسم المستخدم',
        'password' => 'كلمة المرور',
        'remote' => 'الاتصالات من',
        'remote_helper' => 'المكان الذي يجب السماح بالاتصالات منه. اتركه فارغًا للسماح بالاتصالات من أي مكان.',
        'max_connections' => 'الحد الأقصى للاتصالات',
        'created_at' => 'تم الإنشاء في',
        'connection_string' => 'سلسلة اتصال JDBC',
    ],
    'error' => 'خطأ في الاتصال بالمضيف',
    'host' => 'المضيف',
    'host_help' => 'عنوان IP أو اسم النطاق الذي يجب استخدامه عند محاولة الاتصال بهذا المضيف MySQL من هذه اللوحة لإنشاء قواعد بيانات جديدة.',
    'port' => 'المنفذ',
    'port_help' => 'المنفذ الذي يعمل عليه MySQL لهذا المضيف.',
    'max_database' => 'الحد الأقصى لعدد قواعد البيانات',
    'max_databases_help' => 'الحد الأقصى لعدد قواعد البيانات التي يمكن إنشاؤها على هذا المضيف. إذا تم الوصول إلى الحد، فلن يمكن إنشاء قواعد بيانات جديدة على هذا المضيف. اتركه فارغًا ليكون غير محدود.',
    'display_name' => 'اسم العرض',
    'display_name_help' => 'عنوان IP أو اسم المجال الذي يجب أن يظهر للمستخدم النهائي.',
    'username' => 'اسم المستخدم',
    'username_help' => 'اسم المستخدم لحساب لديه أذونات كافية لإنشاء مستخدمين جدد وقواعد بيانات على النظام.',
    'password' => 'كلمة المرور',
    'password_help' => 'كلمة المرور الخاصة بمستخدم قاعدة البيانات.',
    'linked_nodes' => 'العقد المرتبطة',
    'linked_nodes_help' => 'يكون هذا الإعداد افتراضيًا فقط لهذا المضيف عند إضافة قاعدة بيانات إلى خادم على العقدة المحددة.',
    'connection_error' => 'خطأ في الاتصال بمضيف قاعدة البيانات',
    'no_database_hosts' => 'لا توجد مضيفات قواعد بيانات',
    'no_nodes' => 'لا توجد عقد',
    'delete_help' => 'مضيف قاعدة البيانات يحتوي على قواعد بيانات',
    'unlimited' => 'غير محدود',
    'anywhere' => 'في أي مكان',

    'rotate' => 'تدوير',
    'rotate_password' => 'تدوير كلمة المرور',
    'rotated' => 'تم تدوير كلمة المرور',
    'rotate_error' => 'فشل تدوير كلمة المرور',
    'databases' => 'قواعد البيانات',

    'setup' => [
        'preparations' => 'التحضيرات',
        'database_setup' => 'إعداد قاعدة البيانات',
        'panel_setup' => 'إعداد اللوحة',

        'note' => 'حالياً، يتم دعم قواعد البيانات MySQL/MariaDB فقط لمضيفي قاعدة البيانات!',
        'different_server' => 'هل اللوحة وقاعدة البيانات <i>ليسا</i> على نفس الخادم؟',

        'database_user' => 'مستخدم قاعدة البيانات',
        'cli_login' => 'استخدم <code>mysql -u root -p</code> للوصول إلى mysql cli.',
        'command_create_user' => 'الأمر لإنشاء المستخدم',
        'command_assign_permissions' => 'الأمر لتعيين الصلاحيات',
        'cli_exit' => 'للخروج من mysql cli عليك تشغيل الأمر <code>exit</code>.',
        'external_access' => 'الوصول الخارجي',
        'allow_external_access' => '
                                    <p>من المحتمل أنك ستحتاج إلى السماح بالوصول الخارجي إلى قاعدة البيانات MySQL حتى تتمكن الخوادم من الاتصال به.</p>
                                    <br>
                                    <p>لتفعل ذلك، عليك فتح الملف<code>my.cnf</code>، الذي يختلف مكانه اعتمادا على نظام التشغيل وكيفية تثبيت قاعدة البيانات MYSQL، يمكنك كتابة <code>/etc -iname my.cnf</code> لتجده</p>
                                    <br>
                                    <p>افتح الملف <code>my.cnf</code>، اضف النص المشار عليه في الأسفل إلى نهاية الملف ثم قم بحفظه:<br>
                                    <code>[mysqld]<br>bind-address=0.0.0.0</code></p>
                                    <br>
                                    <p>أعد تشغيل MySQL/ MariaDB لتطبيق هذه التغيرات، هذا سيتجاوز إعدادات MySQL الافتراضية، التي في الافتراضي تقبل الطلبات فقط من الجهاز المحلي، تحديث هذا سيسمح بالاتصالات على جميع الواجهات، وبالتالي الاتصالات الخارجية، تأكد من السماح لمنفذ MySQL (الافتراضي 3306) في جدار الحماية الخاص بك.</p>                                ',
    ],
];
