<?php

return [
    'email' => [
        'title' => 'تحديث بريدك الإلكتروني',
        'updated' => 'تم تحديث عنوان بريدك الإلكتروني.',
    ],
    'password' => [
        'title' => 'تغيير كلمة مرورك',
        'requirements' => 'يجب أن تكون كلمة المرور الجديدة مكونة من 8 أحرف على الأقل.',
        'updated' => 'تم تحديث كلمة المرور الخاصة بك.',
    ],
    'two_factor' => [
        'button' => 'إعداد التوثيق الثنائي',
        'disabled' => 'تم تعطيل التوثيق الثنائي في حسابك. لن يُطلب منك تقديم رمز عند تسجيل الدخول.',
        'enabled' => 'تم تفعيل التوثيق الثنائي في حسابك! من الآن فصاعدًا، عند تسجيل الدخول، سيُطلب منك تقديم الرمز الذي يُنتجه جهازك.',
        'invalid' => 'الرمز المقدم غير صالح.',
        'setup' => [
            'title' => 'إعداد التوثيق الثنائي',
            'help' => 'لا يمكن مسح الرمز؟ أدخل الرمز أدناه في تطبيقك:',
            'field' => 'أدخل الرمز',
        ],
        'disable' => [
            'title' => 'تعطيل التوثيق الثنائي',
            'field' => 'أدخل الرمز',
        ],
    ],
];
