<?php

return [
    'title' => 'نظرة عامة على الحساب',
    'email' => [
        'title' => 'تحديث بريدك الإلكتروني',
        'button' => 'تحديث البريد الإلكتروني',
        'updated' => 'تم تحديث عنوان بريدك الإلكتروني.',
    ],
    'password' => [
        'title' => 'تغيير كلمة مرورك',
        'button' => 'تحديث كلمة المرور',
        'requirements' => 'يجب أن تكون كلمة المرور الجديدة مكونة من 8 أحرف على الأقل.',
        'validation' => [
            'account_password' => 'يجب عليك توفير كلمة مرور حسابك.',
            'current_password' => 'يجب عليك توفير كلمة المرور الحالية.',
            'password_confirmation' => 'تأكيد كلمة المرور لا يتطابق مع كلمة المرور التي أدخلتها.',
        ],
        'updated' => 'تم تحديث كلمة المرور الخاصة بك.',
    ],
    'two_factor' => [
        'title' => 'التحقق بخطوتين',
        'button' => 'إعداد التوثيق الثنائي',
        'disabled' => 'تم تعطيل التوثيق الثنائي في حسابك. لن يُطلب منك تقديم رمز عند تسجيل الدخول.',
        'enabled' => 'تم تفعيل التوثيق الثنائي في حسابك! من الآن فصاعدًا، عند تسجيل الدخول، سيُطلب منك تقديم الرمز الذي يُنتجه جهازك.',
        'invalid' => 'الرمز المقدم غير صالح.',
        'enable' => [
            'help' => 'ليس لديك حاليا التحقق من خطوتين مفعّل على حسابك. انقر على الزر أدناه للبدء في إعداده.',
            'button' => 'تفعيل خطوتين',
        ],
        'disable' => [
            'help' => 'التحقق بخطوتين مفعّل حاليًا على حسابك.',
            'title' => 'تعطيل التوثيق الثنائي',
            'field' => 'أدخل الرمز',
            'button' => 'تعطيل خطوتين',
        ],
        'setup' => [
            'title' => 'إعداد التوثيق الثنائي',
            'subtitle' => "ساعد في حماية حسابك من الوصول غير المصرح به. سيتم مطالبتك برمز تحقق في كل مرة تقوم بتسجيل الدخول.",
            'help' => 'لا يمكن مسح الرمز؟ أدخل الرمز أدناه في تطبيقك:',
        ],

        'required' => [
            'title' => 'التحقق بخطوتين مطلوب',
            'description' => 'يجب تفعيل المصادقة الثنائية في حسابك حتى تتمكن من المتابعة.',
        ],
    ],
];
