<?php

return [
    'appsettings' => [
        'comment' => [
            'author' => 'Увядзіце адрас электроннай пошты, з якога павінны быць адпраўлены вобразамі, экспартаваныя з гэтай панэлі. Гэта павінен быць сапраўдны адрас электроннай пошты.',
            'url' => 'URL прыкладання павінен пачынацца з https:// або http:// ў залежнасці ад таго, ці выкарыстоўваецца SSL. Калі схема не будзе ўключаная, вашыя электронныя лісты і іншы кантэнт будуць спасылацца на няправільнае месца.',
            'timezone' => 'Часавы пояс павінен супадаць з адным з падтрымліваемых часавых паясоў PHP. Калі вы не ўпэўнены, калі ласка, звярніцеся да https://php.net/manual/en/timezones.php.',
        ],
        'redis' => [
            'note' => 'Вы выбралі драйвер Redis для адной або некалькіх опцый, калі ласка, прадастаўце сапраўдныя дадзеныя для падключэння ніжэй. У большасці выпадкаў вы можаце выкарыстоўваць па змоўчанні параметры, калі не змянялі вашу наладу.',
            'comment' => 'Па змоўчанні экземпляр Redis мае імя карыстальніка "default" і не мае пароля, паколькі ён працуе лакальна і недаступны знешняму свету. Калі гэта так, проста націсніце enter без уводу значэння.',
            'confirm' => 'Выглядае, што :field ужо вызначаны для Redis, хочаце змяніць?',
        ],
    ],
    'database_settings' => [
        'DB_HOST_note' => 'Рекомендуецца не выкарыстоўваць "localhost" як хост базы дадзеных, бо мы часта сутыкаліся з праблемамі падключэння праз сокеты. Калі вы хочаце выкарыстоўваць лакальнае падключэнне, вам трэба выкарыстоўваць "127.0.0.1".',
        'DB_USERNAME_note' => 'Выкарыстанне ўліковага запісу root для падключэнняў да MySQL не толькі настойліва не рэкамендуецца, але таксама не дазваляецца гэтым прыкладаннем. Вам трэба стварыць карыстальніка MySQL для гэтага праграмнага забеспячэння.',
        'DB_PASSWORD_note' => 'Выглядае, што ў вас ужо вызначаны пароль для падключэння MySQL, хочаце яго змяніць?',
        'DB_error_2' => 'Вашы дадзеныя для падключэння не былі захаваныя. Вам трэба ўвесці сапраўдныя дадзеныя для падключэння, перш чым працягнуць.',
        'go_back' => 'Вярнуцца і паспрабаваць зноў',
    ],
    'make_node' => [
        'name' => 'Увядзіце кароткі ідэнтыфікатар, які выкарыстоўваецца для адрознення гэтага вузла ад іншых',
        'description' => 'Увядзіце апісанне для ідэнтыфікацыі вузла',
        'scheme' => 'Калі ласка, увядзіце https для SSL або http для не-ssl злучэння',
        'fqdn' => 'Увядзіце даменнае імя (напрыклад, node.example.com), якое будзе выкарыстоўвацца для падключэння да дэману. IP-адрас можа выкарыстоўвацца толькі ў тым выпадку, калі вы не выкарыстоўваеце SSL для гэтага вузла',
        'public' => 'Ці павінен гэты вузел быць публічным? Як заўвага, усталёўка вузла ў рэжым прыватнасці будзе адмаўляць магчымасць аўтаматычнага разгортвання на гэтым вузле',
        'behind_proxy' => 'Ваш FQDN знаходзіцца за проксі?',
        'maintenance_mode' => 'Ці павінен быць уключаны рэжым абслугоўвання?',
        'memory' => 'Увядзіце максімальную колькасць памяці',
        'memory_overallocate' => 'Увядзіце колькасць памяці для пераразмеркавання, -1 адключыць праверку, а 0 не дазволіць ствараць новыя серверы',
        'disk' => 'Увядзіце максімальную колькасць месца на дыску',
        'disk_overallocate' => 'Увядзіце колькасць месца на дыску для пераразмеркавання, -1 адключыць праверку, а 0 не дазволіць ствараць новыя серверы',
        'cpu' => 'Увядзіце максімальную колькасць працэсарных рэсурсаў',
        'cpu_overallocate' => 'Увядзіце колькасць працэсарных рэсурсаў для пераразмеркавання, -1 адключыць праверку, а 0 не дазволіць ствараць новыя серверы',
        'upload_size' => 'Увядзіце максімальны памер файла для загрузкі',
        'daemonListen' => 'Увядзіце порт для праслухоўвання дэману',
        'daemonConnect' => 'Увядзіце порт для падключэння дэману (можа супадаць з портам слухання)',
        'daemonSFTP' => 'Увядзіце порт праслухоўвання SFTP дэману',
        'daemonSFTPAlias' => 'Увядзіце псеўданім SFTP дэману (можа быць пустым)',
        'daemonBase' => 'Увядзіце асноўную тэчку',
        'success' => 'Паспяхова створаны новы вузел з імем :name і Id :id',
    ],
    'node_config' => [
        'error_not_exist' => 'Выбраны вузел не існуе.',
        'error_invalid_format' => 'Указаны няправільны фармат. Дапушчальныя фарматы: yaml і json.',
    ],
    'key_generate' => [
        'error_already_exist' => 'Выглядае, што вы ўжо наладзілі ключ шыфравання прыкладання. Працягваючы гэты працэс, вы перазапішаце гэты ключ і выклікаеце пашкоджанне дадзеных для ўжо зашыфраваных дадзеных. НЕ ПРАДАЛЖАЙЦЕ, КАЛІ НЕ ВЕДАЕЦЕ, ШТО РАБІЦЕ.',
        'understand' => 'Я разумею наступствы выканання гэтай каманды і бяру на сябе ўсю адказнасць за страту зашыфраваных дадзеных.',
        'continue' => 'Вы ўпэўнены, што хочаце працягнуць? Змена ключа шыфравання прыкладання прівядзе да страту дадзеных.',
    ],
    'schedule' => [
        'process' => [
            'no_tasks' => 'Няма запланаваных задач для сервера, якія трэба выканаць.',
            'error_message' => 'Узнікла памылка пры апрацоўцы задачы: ',
        ],
    ],
];
