<?php

return [
    'daemon_connection_failed' => 'Узнікла памылка пры спробе ўзаемадзеяння з дэманам, што прывяло да кода адказу HTTP/:code. Гэтая памылка была запісана ў журнал.',
    'node' => [
        'servers_attached' => 'Вузел павінен мець адключаныя ўсе серверы, каб яго можна было выдаліць.',
        'error_connecting' => 'Немагчыма падключыцца да :node',
        'daemon_off_config_updated' => 'Канфігурацыя дэману <strong>была абноўлена</strong>, аднак узнікла памылка пры спробе аўтаматычна абнавіць канфігурацыйны файл дэману. Вам трэба будзе ўручную абнавіць канфігурацыйны файл (config.yml), каб дэман ужыў гэтыя змены.',
    ],
    'allocations' => [
        'server_using' => 'Сервер ужо прывязаны да гэтай сеткі. Сетка можа быць выдалена толькі ў выпадку, калі сервер не прывязаны.',
        'too_many_ports' => 'Дадаць больш за 1000 портаў у адзін дыяпазон адразу не падтрымліваецца.',
        'invalid_mapping' => 'Картаванне для порта :port няправільнае і не можа быць апрацавана.',
        'cidr_out_of_range' => 'Натацыя CIDR дазваляе выкарыстоўваць маскі толькі ў межах /25 і /32.',
        'port_out_of_range' => 'Порты ў сетцы павінны быць большымі за 1024 і меншымі або роўнымі 65535.',
    ],
    'egg' => [
        'delete_has_servers' => 'Вобраз з актыўнымі серверамі, падключанымі да яго, не можа быць выдалены з панэлі.',
        'invalid_copy_id' => 'Вобраз, выбраны для капіравання скрыпта, не існуе або капіруе сам скрыпт.',
        'has_children' => 'Гэты вобраз з\'яўляецца бацькам аднаго ці некалькіх іншых вобразаў. Калі ласка, выдаліце гэтыя вобразаў перад выдаленнем гэтага.',
    ],
    'variables' => [
        'env_not_unique' => 'Зменная асяроддзя :name павінна быць унікальнай для гэтага вобраза.',
        'reserved_name' => 'Зменная асяроддзя :name абароненая і не можа быць прызначана іншай зменнай.',
        'bad_validation_rule' => 'Правіла праверкі ":rule" не з\'яўляецца сапраўдным правілам для гэтага прыкладання.',
    ],
    'importer' => [
        'json_error' => 'Узнікла памылка пры спробе прачытаць JSON файл: :error.',
        'file_error' => 'Пададзены JSON файл не з\'яўляецца сапраўдным.',
        'invalid_json_provided' => 'Пададзены JSON файл не ў фармаце, які можа быць распазнаны.',
    ],
    'subusers' => [
        'editing_self' => 'Змяненне ўліковага запісу свайго падкарыстальніка не дазваляецца.',
        'user_is_owner' => 'Вы не можаце дадаць ўладальніка сервера як падкарыстальніка для гэтага сервера.',
        'subuser_exists' => 'Карыстальнік з гэтай поштай ужо прызначаны падкарыстальнікам для гэтага сервера.',
    ],
    'databases' => [
        'delete_has_databases' => 'Нельга выдаліць сервер базы даных, калі на ім ёсць актыўныя базы дадзеных.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Максімальны інтэрвал для спасцяжнай задачы складае 15 хвілін.',
    ],
    'locations' => [
        'has_nodes' => 'Нельга выдаліць размяшчэнне, калі на яго прывязаны актыўныя вузлы.',
    ],
    'users' => [
        'is_self' => 'Нельга выдаліць уліковы запіс карыстальніка.',
        'has_servers' => 'Нельга выдаліць карыстальніка, калі ў яго ёсць актыўныя серверы. Спачатку выдаліце іх серверы.',
        'node_revocation_failed' => 'Не ўдалося адклікаць ключы на <a href=":link">вузле #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'Няма вузлоў, якія адпавядаюць патрабаванням для аўтаматычнага разгортвання.',
        'no_viable_allocations' => 'Няма сетак, якія адпавядаюць патрабаванням для аўтаматычнага разгортвання.',
    ],
    'api' => [
        'resource_not_found' => 'Запытаны рэсурс не існуе на гэтым серверы.',
    ],
    'mount' => [
        'servers_attached' => 'Вобраз павінен мець адключаныя ўсе серверы, каб яго можна было выдаліць.',
    ],
    'server' => [
        'marked_as_failed' => 'Гэты сервер яшчэ не завершыў працэс усталёўкі, паспрабуйце пазней.',
    ],
];
