<?php

return [
    'heading' => 'Добре дошъл в Pelican!',
    'version' => 'Верия: :version',
    'advanced' => 'За напреднали',
    'server' => 'Сървър',
    'user' => 'Потребител',
    'sections' => [
        'intro-developers' => [
            'heading' => 'Информация за разработчици',
            'content' => 'Благодарим ви че изпробвате версията за разработка!',
            'extra_note' => 'Ако намерите някакви проблеми, моля докладвайте ги в GitHub.',
            'button_issues' => 'Създай проблем',
            'button_features' => 'Обсъждане на характеристиките',
        ],
        'intro-update-available' => [
            'heading' => 'Налична актуализация',
            'content' => ':latestVersion вече е налична! Прочети нашата докоментация за да актуализираш твоя панел.',
        ],
        'intro-no-update' => [
            'heading' => 'Вашият панел е актуален',
            'content' => 'Използвате Pelican версия :version. Вашият панел е актуален!',
        ],
        'intro-first-node' => [
            'heading' => 'Не са намерени node-ове',
            'content' => 'Изглежда че нямаш конфигурирани node-ове но не се притеснявай, защото можеш да натиснеш бутона за действие да създадеш първия си node.',
            'extra_note' => 'Ако намерите някакви проблеми моля, докладвайте ги в GitHub.',
            'button_label' => 'Създай първия си Node в Pelican',
        ],
        'intro-support' => [
            'heading' => 'Подкрепете Pelican',
            'content' => 'Благодарим ви че използваш Pelican, Това можеше да се случи само чрез твойта подкрепа, на нашите сътрудници и останалите ни поддръжници!',
            'extra_note' => 'Оценяваме каквато и да е подкрепа от всеки.',
            'button_translate' => 'Помогнете с превода',
            'button_donate' => 'Дари директно',
        ],
        'intro-help' => [
            'heading' => 'Нужда от помощ?',
            'content' => 'Погледни документацията първо! Ако още ти е нужна помощ, отиди в нашият Discord сървър!',
            'button_docs' => 'Прочети документацията',
        ],
    ],
];
