<?php

return [
    'nav_title' => 'Сървъри на база данни',
    'model_label' => 'Сървър на базата данни',
    'model_label_plural' => 'Сървъри на база данни',
    'table' => [
        'database' => 'База данни',
        'name' => 'Име',
        'host' => 'Адрес',
        'port' => 'Порт',
        'name_helper' => 'Оставяне на полето празно ще генерира име',
        'username' => 'Потребителско име',
        'password' => 'Парола',
        'remote' => 'Връзки от',
        'remote_helper' => 'От къде да бъдат позволени връзки. Оставете празно за да бъдат позволени от всякъде.',
        'max_connections' => 'Максимален брой връзки',
        'created_at' => 'Създаден от',
        'connection_string' => 'Справка за връзка JDBC',
    ],
    'error' => 'Проблем при свързването с :node',
    'host' => 'Хост',
    'host_help' => 'IP адресът или домейна които ще се използва за връзка към то MYSQL сървър към Panel-а за да създадете нова база данни',
    'port' => 'Порт',
    'port_help' => 'Порта който използва Mysql.',
    'max_database' => 'Максимален брой база данни',
    'max_databases_help' => 'Максималната бройка база данни, които могат да бъдат създадени на този хост. Ако лимитът е достигнат, нови бази данни не могат да бъдат създавани. Оставете празно за неограничен лимит.',
    'display_name' => 'Потребителско име',
    'display_name_help' => 'IP адресът или домейнът, който трябва да бъде показан на крайния потребител.',
    'username' => 'Потребителско име',
    'username_help' => 'Потребителското име на профил, който има достатъчно права за създаване на нови потребители и бази данни в системата.',
    'password' => 'Парола',
    'password_help' => 'Парола на потребителя за базата данни',
    'linked_nodes' => 'Свързани Node-ове',
    'linked_nodes_help' => 'Тази настройка по подразбиране задава този хост на база данни само когато се добавя база данни към сървър на избрания Node.',
    'connection_error' => 'Грешка при свързване с хоста на базата данни',
    'no_database_hosts' => 'Няма сървъри на бази данни',
    'no_nodes' => 'Няма Node-ове',
    'delete_help' => 'Хостът има бази данни',
    'unlimited' => 'Неограничено',
    'anywhere' => 'Навсякъде',

    'rotate' => 'Завърти',
    'rotate_password' => 'Нулирай парола',
    'rotated' => 'Паролата е нулирана',
    'rotate_error' => 'Грешка при нулиране на паролата',
    'databases' => 'Бази данни',

    'setup' => [
        'preparations' => 'Подготовки',
        'database_setup' => 'Настройка на базата данни',
        'panel_setup' => 'Настройка на панела',

        'note' => 'До момента се поддържат само бази данни от типа MySQL/MariaDB!',
        'different_server' => 'Панелът и базата данни <i>не</i> са на един и същ сървър?',

        'database_user' => 'Потребител за базата данни',
        'cli_login' => 'Използвайте <code>mysql -u root -p</code> за достъп до mysql cli.',
        'command_create_user' => 'Команда за създаване на потребител',
        'command_assign_permissions' => 'Команда за задаване на права',
        'cli_exit' => 'За да излезете от mysql cli, изпълнете <code>exit</code>.',
        'external_access' => 'Външен достъп',
        'allow_external_access' => '
                                   <p>Вероятно ще трябва да разрешите външен достъп до този MySQL сървър, за да могат игралните сървъри да се свързват с него.</p>
                                    <br>
                                    <p>За да направите това, отворете <code>my.cnf</code>, чието местоположение варира в зависимост от вашата операционна система и начина на инсталиране на MySQL. Можете да използвате команда find <code>/etc -iname my.cnf</code>, за да го намерите.</p>
                                    <br>
                                    <p>Отворете <code>my.cnf</code>, добавете този текст отдолу и го запазете:<br>
                                    <code>[mysqld]<br>bind-address=0.0.0.0</code></p>
                                    <br>
                                    <p>Рестартирайте MySQL/MariaDB, за да приложите тези промени. Това ще отмени конфигурацията по подразбиране на MySQL, която по подразбиране приема заявки само от localhost. Актуализирането на това ще позволи външни връзки на всички интерфейси. Уверете се, че сте разрешили MySQL порта (по подразбиране 3306) във вашата защитна стена.</p>
                                ',
    ],
];
