<?php

return [
    'notices' => [
        'imported' => 'Успешно импортира този egg и неговите променливи.',
        'updated_via_import' => 'Този egg бе актуализиран с предоставения файл.',
        'deleted' => 'Успешно изтри този egg от панела.',
        'updated' => 'Конфигурацията на този egg бе успешно актуализирана.',
        'script_updated' => 'Скриптът за този egg бе актуализиран и ще се използва когато сървъри се инсталират.',
        'egg_created' => 'Нов egg бе добавен успешно. Ще трябва да рестартираш всеки работещ daemon за да се приложи този egg.',
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'Променливото ":variable" бе изтрито и няма да е налично на сървъри след преинсталиране.',
            'variable_updated' => 'Променливото ":variable" бе актуализирано. Ще трябва да преинсталираш всички сървър които ползват това промеливо за да приложиш промените.',
            'variable_created' => 'Ново променливо успешно бе създадено и присвоено на този egg.',
        ],
    ],
    'descriptions' => [
        'name' => 'Просто име което да се използва като идентификатор на този egg.',
        'description' => 'Описание на този egg който ще се показва в панела когато е нужно',
        'uuid' => 'Това е глобален уникален идентикатор за този egg който Wings ползва за идентификатор.',
        'author' => 'Автора на тази версия на egg-а. Kaчването на нова конфигурация за този egg от друг автор ще смени това.',
        'force_outgoing_ip' => "Принуждава целия изходящ мрежов трафик да има своя изходен IP да е NATed до IP към главния IP адрес на сървъра. \nИзисква се за определени игри да работят правилно когато node-a има няколко публични IP адреси.\nВключването на тази опция ще изключи вътрешната мрежа за сървърите които ползват този egg, карайки ги да не могат да имат достъп вътрешно до други сървъри на същия node.",
        'startup' => 'Командата по подразбиране която трябва да бъде ползвана за нови сървъри използващи този egg.',
        'docker_images' => 'Наличните docker image-ове на сървъри използващи този egg.',
    ],
];
