<?php

return [
    'validation' => [
        'fqdn_not_resolvable' => 'Този FQDN или IP адрес не resolve-ва до валиден IP адрес.',
        'fqdn_required_for_ssl' => 'Изисква се fully qualified домейн който resolve-ва до публичен IP адрес за да се използва SSL за този node.',
    ],
    'notices' => [
        'allocations_added' => 'Алокации успешно бе добавени на този node.',
        'node_deleted' => 'Този node успешно бе премахнат от панела.',
        'node_created' => 'Успешно създаде нов node. Можеш автоматично да конфигурираш daemon-а на тази машина, като посетиш раздела \'Конфигурация\'. <strong>Преди да добавиш сървъри трябва да алокираш поне един IP адрес и порт.</strong>',
        'node_updated' => 'Информацията за този node бе актуализирана. Ако daemon настройки са променени, ще трябва да го рестартираш за да се приложат.',
        'unallocated_deleted' => 'Изтри всички не-алокирани портове за <code>:ip</code>',
    ],
];
