<?php

return [
    'exceptions' => [
        'user_has_servers' => 'Не можеш да изтриеш потребител с активни сървъри свързани с неговия акаунт. Моля изтрии сървърите му преди да продължиш.',
        'user_is_self' => 'Не можеш да изтриеш собстения си потребителски акаунт.',
    ],
    'notices' => [
        'account_created' => 'Акаунтът бе създаден успешно.',
        'account_updated' => 'Акаунтът успешно бе актуализиран.',
    ],
    'last_admin' => [
        'hint' => 'Това е последният root администратор!',
        'helper_text' => 'Трябва да имаш поне един root администратор в системата ти.',
    ],
    'root_admin' => 'Администратор (Root)',
    'language' => [
        'helper_text1' => 'Твоят език (:state) не е преведен още!\nНо не се страхувай, можеш да помогнеш да оправиш това',
        'helper_text2' => 'като допринасяш директно тук',
    ],
];
