<?php

return [
    'user' => [
        'search_users' => 'एक उपयोगकर्ता नाम, उपयोगकर्ता आईडी, या ईमेल पता दर्ज करें',
        'select_search_user' => 'हटाने के लिए उपयोगकर्ता की आईडी (पुनः खोजने के लिए \'0\' दर्ज करें)',
        'deleted' => 'उपयोगकर्ता को पैनल से सफलतापूर्वक हटा दिया गया.',
        'confirm_delete' => 'क्या आप वाकई इस उपयोगकर्ता को पैनल से हटाना चाहते हैं?',
        'no_users_found' => 'प्रदान किए गए खोज शब्द के लिए कोई उपयोगकर्ता नहीं मिला।',
        'multiple_found' => 'प्रदान किए गए उपयोगकर्ता के लिए कई खाते पाए गए, जो --नो-इंटरैक्शन फ़्लैग के कारण किसी उपयोगकर्ता को हटाने में असमर्थ थे।',
        'ask_admin' => 'क्या यह उपयोगकर्ता एक व्यवस्थापक है?',
        'ask_email' => 'मेल पता',
        'ask_username' => 'उपयोगकर्ता नाम',
        'ask_password' => 'पासवर्ड',
        'ask_password_tip' => 'यदि आप उपयोगकर्ता को ईमेल द्वारा एक यादृच्छिक पासवर्ड के साथ एक खाता बनाना चाहते हैं, तो इस कमांड को फिर से चलाएँ (CTRL+C) और `--no-password` फ़्लैग पास करें।',
        'ask_password_help' => 'पासवर्ड कम से कम 8 अक्षरों का होना चाहिए और उसमें कम से कम एक बड़ा अक्षर और संख्या होनी चाहिए।',
        '2fa_help_text' => [
            'सक्षम होने पर यह कमांड उपयोगकर्ता के खाते के लिए 2-कारक प्रमाणीकरण को अक्षम कर देगा। इसका उपयोग केवल खाता पुनर्प्राप्ति आदेश के रूप में किया जाना चाहिए यदि उपयोगकर्ता अपने खाते से लॉक हो गया हो।',
            'यदि यह वह नहीं है जो आप करना चाहते थे, तो इस प्रक्रिया से बाहर निकलने के लिए CTRL+C दबाएँ।',
        ],
        '2fa_disabled' => ':email के लिए 2-फ़ैक्टर प्रमाणीकरण अक्षम कर दिया गया है।',
    ],
    'schedule' => [
        'output_line' => '`:schedule` (:id) में पहले कार्य के लिए जॉब भेजा जा रहा है।',
    ],
    'maintenance' => [
        'deleting_service_backup' => 'सेवा बैकअप फ़ाइल को हटाया जा रहा है :file',
    ],
    'server' => [
        'rebuild_failed' => '":name" (#:id) के लिए नोड ":node" पर पुनर्निर्माण अनुरोध त्रुटि के साथ विफल हुआ: :message',
        'reinstall' => [
            'failed' => '":name" (#:id) के लिए नोड ":node" पर पुनर्स्थापना अनुरोध त्रुटि के साथ विफल हुआ: :message',
            'confirm' => 'आप सर्वरों के एक समूह के विरुद्ध पुनः स्थापित करने वाले हैं। क्या आप जारी रखना चाहते हैं?',
        ],
        'power' => [
            'confirm' => 'आप :count सर्वरों के खिलाफ एक :action करने वाले हैं। क्या आप जारी रखना चाहते हैं?',
            'action_failed' => '":name" (#:id) के लिए नोड ":node" पर पावर एक्शन अनुरोध त्रुटि के साथ विफल हुआ: :message',
        ],
    ],
    'environment' => [
        'mail' => [
            'ask_smtp_host' => 'उदाहरण के लिए, Gmail के लिए SMTP होस्ट \'smtp.gmail.com\' होता है।',
            'ask_smtp_port' => 'SMTP Port',
            'ask_smtp_username' => 'SMTP यूज़रनेम',
            'ask_smtp_password' => 'SMTP पासवर्ड',
            'ask_mailgun_domain' => 'Mailgun डोमेन',
            'ask_mailgun_endpoint' => 'Mailgun Endpoint',
            'ask_mailgun_secret' => 'Mailgun सीक्रेट',
            'ask_mandrill_secret' => 'Mandrill सीक्रेट',
            'ask_postmark_username' => 'Postmark एपीआई कुंजी',
            'ask_driver' => 'ईमेल भेजने के लिए किस ड्राइवर का उपयोग किया जाना चाहिए?',
            'ask_mail_from' => 'ईमेल पते जिनसे ईमेल भेजे जाने चाहिए',
            'ask_mail_name' => 'ईमेल किस नाम से दिखाई देना चाहिए',
            'ask_encryption' => 'उपयोग करने के लिए एन्क्रिप्शन विधि',
        ],
    ],
];
