<?php

return [
    'nav_title' => 'Hosts Βάσεων Δεδομένων',
    'model_label' => 'Host Βάσης Δεδομένων',
    'model_label_plural' => 'Hosts Βάσεων Δεδομένων',
    'table' => [
        'database' => 'Βάση Δεδομένων',
        'name' => 'Όνομα',
        'host' => 'Host',
        'port' => 'Θύρα',
        'name_helper' => 'Αφήνοντας το κενό θα δημιουργήσει αυτόματα ένα τυχαίο όνομα',
        'username' => 'Όνομα Χρήστη',
        'password' => 'Κωδικόs πρόσβασης',
        'remote' => 'Συνδέσεις Από',
        'remote_helper' => 'Από πού θα επιτρέπονται συνδέσεις. Αφήστε κενό για να επιτρέπονται συνδέσεις από οπουδήποτε.',
        'max_connections' => 'Μέγιστος αριθμός συνδέσεων',
        'created_at' => 'Δημιουργήθηκε στις',
        'connection_string' => 'String Σύνδεσης JDBC',
    ],
    'error' => 'Σφάλμα κατά τη σύνδεση στο host',
    'host' => 'Host',
    'host_help' => 'Η διεύθυνση IP ή το Domain name που θα χρησιμοποιηθεί κατά την προσπάθεια σύνδεσης σε αυτόν τον MySQL host από αυτόν το Panel για τη δημιουργία νέων βάσεων δεδομένων.',
    'port' => 'Θύρα',
    'port_help' => 'Η θύρα στην οποία εκτελείται η MySQL για αυτό το host.',
    'max_database' => 'Μέγιστες Βάσεις Δεδομένων',
    'max_databases_help' => 'Ο μέγιστος αριθμός βάσεων δεδομένων που μπορούν να δημιουργηθούν σε αυτό το host. Αν συμπληρωθεί το όριο, δεν μπορούν να δημιουργηθούν νέες βάσεις δεδομένων σε αυτo host. Το κενό είναι απεριόριστο.',
    'display_name' => 'Εμφανιζόμενο Όνομα',
    'display_name_help' => 'Η διεύθυνση IP ή το Domain name που πρέπει να εμφανίζεται στον τελικό χρήστη.',
    'username' => 'Όνομα Χρήστη',
    'username_help' => 'Το όνομα χρήστη ενός λογαριασμού που έχει αρκετά δικαιώματα για να δημιουργήσει νέους χρήστες και βάσεις δεδομένων στο σύστημα.',
    'password' => 'Συνθηματικό',
    'password_help' => 'Ο κωδικός πρόσβασης για το χρήστη της βάσης δεδομένων.',
    'linked_nodes' => 'Συνδεδεμένα nodes',
    'linked_nodes_help' => 'Αυτή η ρύθμιση βρίσκεται μόνο από προεπιλογή σε αυτό το host βάσεων δεδομένων όταν προστίθεται μια βάση δεδομένων σε ένα host στον επιλεγμένο κόμβο.',
    'connection_error' => 'Σφάλμα κατά τη σύνδεση στο host βάσεων δεδομένων',
    'no_database_hosts' => 'Δεν υπάρχουν host βάσεων δεδομένων',
    'no_nodes' => 'Δεν υπάρχουν Nodes',
    'delete_help' => 'Ο Host βάσεων δεδομένων έχει βάσεις δεδομένων',
    'unlimited' => 'Απεριόριστα',
    'anywhere' => 'Οπουδήποτε',

    'rotate' => 'Εναλλαγή',
    'rotate_password' => 'Αλλαγή κωδικού πρόσβασης',
    'rotated' => 'Ο κωδικός άλλαξε!',
    'rotate_error' => 'Η αλλαγή κωδικού απέτυχε',
    'databases' => 'Βάσεις Δεδομένων',

    'setup' => [
        'preparations' => 'Προετοιμασία',
        'database_setup' => 'Ρύθμιση Βάσης Δεδομένων',
        'panel_setup' => 'Ρύθμιση Panel',

        'note' => 'Επί του παρόντος, υποστηρίζονται μόνο βάσεις δεδομένων MySQL/ MariaDB για host βάσεων δεδομένων!',
        'different_server' => 'Είναι το panel και η βάση δεδομένων <i>not</i> στον ίδιο διακομιστή?',

        'database_user' => 'Χρήστης Βάσης Δεδομένων',
        'cli_login' => 'Χρησιμοποιήστε <code>mysql -u root -p</code> για να αποκτήσετε πρόσβαση στο mysql cli.',
        'command_create_user' => 'Εντολή για τη δημιουργία του χρήστη',
        'command_assign_permissions' => 'Εντολή για εκχώρηση δικαιωμάτων',
        'cli_exit' => 'Για να βγείτε από το mysql cli εκτελέστε <code>exit</code>.',
        'external_access' => 'Εξωτερική Πρόσβαση',
        'allow_external_access' => '
<p>Πιθανότατα θα χρειαστεί να επιτρέψετε εξωτερική πρόσβαση σε αυτό το instance του MySQL ώστε να μπορούν οι servers να συνδεθούν σε αυτό.</p>
<br>
<p>Για να το κάνετε αυτό, ανοίξτε το <code>my.cnf</code>, το οποίο βρίσκεται σε διαφορετική τοποθεσία ανάλογα με το λειτουργικό σας σύστημα και τον τρόπο εγκατάστασης του MySQL. Μπορείτε να πληκτρολογήσετε <code>find /etc -iname my.cnf</code> για να το εντοπίσετε.</p>
<br>
<p>Ανοίξτε το <code>my.cnf</code>, προσθέστε το παρακάτω κείμενο στο τέλος του αρχείου και αποθηκεύστε το:<br>
<code>[mysqld]<br>bind-address=0.0.0.0</code></p>
<br>
<p>Κάντε επανεκκίνηση του MySQL/MariaDB για να εφαρμοστούν αυτές οι αλλαγές. Αυτό θα παρακάμψει την προεπιλεγμένη ρύθμιση του MySQL, η οποία από προεπιλογή δέχεται αιτήματα μόνο από localhost. Ενημερώνοντας αυτό, θα επιτρέπονται συνδέσεις από όλα τα interfaces και συνεπώς εξωτερικές συνδέσεις. Βεβαιωθείτε ότι έχετε επιτρέψει τη θύρα του MySQL (προεπιλογή 3306) στο firewall σας.</p>                                ',
    ],
];
