<?php

return [
    'notices' => [
        'imported' => 'Επιτυχής εισαγωγή αυτού του Αυγού και των σχετικών μεταβλητών.',
        'updated_via_import' => 'Αυτό το αυγό έχει ενημερωθεί χρησιμοποιώντας το αρχείο που παρέχεται.',
        'deleted' => 'Διαγράφηκε με επιτυχία το αυγό που ζητήθηκε από το panel.',
        'updated' => 'Η ρύθμιση παραμέτρων αυτού του αυγού έχει ενημερωθεί με επιτυχία.',
        'script_updated' => 'Το σενάριο εγκατάστασης των αυγών έχει ενημερωθεί και θα εκτελείται όποτε εγκαθίστανται οι διακομιστές.',
        'egg_created' => 'Ένα νέο αυγό ορίστηκε με επιτυχία. Θα πρέπει να επανεκκινήσετε τυχόν εκτελούμενα daemons για να εφαρμόσετε αυτό το νέο αυγό.',
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'Η μεταβλητή ":variable" έχει διαγραφεί και δεν θα είναι πλέον διαθέσιμη στους διακομιστές μετά την αναδόμηση.',
            'variable_updated' => 'Η μεταβλητή ":variable" έχει ενημερωθεί. Θα χρειαστεί να αναδημιουργήσεις όλους τους διακομιστές που χρησιμοποιούν αυτήν τη μεταβλητή για να εφαρμοστούν οι αλλαγές.',
            'variable_created' => 'Η νέα μεταβλητή δημιουργήθηκε και αντιστοιχίστηκε με επιτυχία σε αυτό το αυγό.',
        ],
    ],
];
