<?php

return [
    'notices' => [
        'imported' => 'Επιτυχής εισαγωγή του αυγού και των σχετικών μεταβλητών του.',
        'updated_via_import' => 'Αυτό το αυγό ενημερώθηκε χρησιμοποιώντας το αρχείο που παρείχατε.',
        'deleted' => 'Διαγράφηκε με επιτυχία το egg που ζητήθηκε από το panel.',
        'updated' => 'Η ρύθμιση παραμέτρων αυτού του egg έχουν ενημερωθεί με επιτυχία.',
        'script_updated' => 'Το σενάριο εγκατάστασης για τα eggs έχει ενημερωθεί και θα εκτελείται όποτε εγκαθίστανται οι διακομιστές.',
        'egg_created' => 'Ένα νέο egg ορίστηκε με επιτυχία. Θα πρέπει να επανεκκινήσετε τυχόν εκτελούμενα daemons για να εφαρμόσετε αυτό το νέο egg.',
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'Η μεταβλητή ":variable" έχει διαγραφεί και δεν θα είναι πλέον διαθέσιμη στους διακομιστές μετά το rebuild.',
            'variable_updated' => 'Η μεταβλητή ":variable" έχει ενημερωθεί. Θα χρειαστεί να κάνετε rebuild όλους τους διακομιστές που χρησιμοποιούν αυτήν τη μεταβλητή για να εφαρμοστούν οι αλλαγές.',
            'variable_created' => 'Η νέα μεταβλητή δημιουργήθηκε και αντιστοιχίστηκε με επιτυχία σε αυτό το egg.',
        ],
    ],
];
