<?php

return [
    'validation' => [
        'fqdn_not_resolvable' => 'Η διεύθυνση FQDN ή IP που παρέχεται δεν επιλύει μια έγκυρη διεύθυνση IP.',
        'fqdn_required_for_ssl' => 'Ένα πλήρως αναγνωρισμένο όνομα τομέα που επιλύει σε μια δημόσια διεύθυνση IP απαιτείται προκειμένου να χρησιμοποιηθεί SSL για αυτόν τον κόμβο.',
    ],
    'notices' => [
        'allocations_added' => 'Οι κατανομές προστέθηκαν με επιτυχία σε αυτόν τον κόμβο.',
        'node_deleted' => 'Ο κόμβος αφαιρέθηκε με επιτυχία από τον πίνακα.',
        'node_created' => 'Το νέο node δημιουργήθηκε με επιτυχία. Μπορείτε να ρυθμίσετε αυτόματα το daemon σε αυτό το μηχάνημα, επισκεπτόμενοι την καρτέλα \'Διαμόρφωση\'. <strong>Για να μπορέσετε να προσθέσετε διακομιστές πρέπει πρώτα να διαθέσετε τουλάχιστον μία διεύθυνση IP και θύρα.</strong>',
        'node_updated' => 'Οι πληροφορίες του node έχουν ενημερωθεί. Αν έχει αλλάξει οποιαδήποτε ρύθμιση daemon, θα πρέπει να επανεκκινήσετε για να τεθούν σε ισχύ αυτές οι αλλαγές.',
        'unallocated_deleted' => 'Διαγράφηκαν όλες οι μη κατανεμημένες θύρες για <code>:ip</code>.',
    ],
];
