<?php

return [
    'exceptions' => [
        'user_has_servers' => 'Δεν είναι δυνατή η διαγραφή ενός χρήστη με ενεργούς διακομιστές συνδεδεμένους στον λογαριασμό του. Παρακαλούμε διαγράψτε τους διακομιστές του πριν συνεχίσετε.',
        'user_is_self' => 'Δεν μπορείτε να διαγράψετε το δικό σας λογαριασμό χρήστη.',
    ],
    'notices' => [
        'account_created' => 'Ο λογαριασμός έχει δημιουργηθεί με επιτυχία.',
        'account_updated' => 'Ο λογαριασμός ενημερώθηκε με επιτυχία.',
    ],
    'last_admin' => [
        'hint' => 'Αυτός είναι ο τελευταίος διαχειριστής root!',
        'helper_text' => 'Πρέπει να έχετε τουλάχιστον έναν root διαχειριστή στο σύστημά σας.',
    ],
    'root_admin' => 'Διαχειριστής (Root)',
    'language' => [
        'helper_text1' => 'Η γλώσσα σας (:state) δεν έχει μεταφραστεί ακόμα!\nΑλλά μην ανησυχείτε, μπορείτε να βοηθήσετε να το διορθώσετε αυτό',
        'helper_text2' => 'συνεισφέροντας άμεσα εδώ',
    ],
];
