<?php

return [
    'exceptions' => [
        'user_has_servers' => 'Δεν είναι δυνατή η διαγραφή ενός χρήστη με ενεργούς διακομιστές συνδεδεμένους στο λογαριασμό του. Παρακαλούμε διαγράψτε τους διακομιστές του πριν συνεχίσετε.',
        'user_is_self' => 'Δεν μπορείτε να διαγράψετε το δικό σας λογαριασμό χρήστη.',
    ],
    'notices' => [
        'account_created' => 'Ο λογαριασμός έχει δημιουργηθεί με επιτυχία.',
        'account_updated' => 'Ο λογαριασμός ενημερώθηκε με επιτυχία.',
    ],
];
