<?php

return [
    'return_to_login' => 'Върни се до вход',
    'failed' => 'Не бе намерен акаунт с тези данни.',

    'login' => [
        'title' => 'Влезни за да продължиш',
        'button' => 'Вход',
        'required' => [
            'username_or_email' => 'Трябва да се предостави потребителско име или имейл.',
            'password' => 'Моля въведи паролата на акаунта ти.',
        ],
    ],

    'forgot_password' => [
        'title' => 'Поискай нулиране на парола.',
        'label' => 'Забрави паролата си?',
        'label_help' => 'Въведи имейл адреса на акаунта ви за да получите инструкции за нулиране на паролата ви.',
        'button' => 'Изпрати имейл',
        'required' => [
            'email' => 'Трябва да се въведе валиден имейл адрес за да се продължи.',
        ],
    ],

    'reset_password' => [
        'title' => 'Нулирай парола',
        'button' => 'Нулирай парола',
        'new_password' => 'Нова парола',
        'confirm_new_password' => 'Потвърди нова парола',
        'requirement' => [
            'password' => 'Паролите трябва да са поне 8 знака дълги',
        ],
        'required' => [
            'password' => 'Новата парола е задължителна.',
            'password_confirmation' => 'Твоята нова парола не съвпада.',
        ],
        'validation' => [
            'password' => 'Твоята нова парола трябва да е поне 8 знака дълга.',
            'password_confirmation' => 'Твоята нова парола не съвпада.',
        ],
    ],

    'checkpoint' => [
        'title' => 'Контролна точка на устройството',
        'recovery_code' => 'Код за възстановяване',
        'recovery_code_description' => 'Въведи един от кодовете за възстановяване когато си направил дву-факторно удостоверяеане на този акаунт за да продължите.',
        'authentication_code' => 'Код за удостоверяване',
        'authentication_code_description' => 'Въведи дву-факторния токен създаден от устройството ти.',
        'button' => 'Продължи',
        'lost_device' => 'Загубих устройството ми',
        'have_device' => 'Имам устройството ми',
    ],

    'two_factor' => [
        'label' => 'Дву-факторен токен',
        'label_help' => 'Този акаунт изисква второ ниво за удостоверяване за да се продължи. Моля въведи кода създаден от устройството ти за да завършите входа.',
        'checkpoint_failed' => 'Този двуфакторен токен е невалиден.',
    ],

    'throttle' => 'Твърде много опити за вход. Моля опитай отново след :seconds секунди.',
    'password_requirements' => 'Паролата трябва да е поне 8 знака дълга и да е единствена за този сайт.',
    '2fa_must_be_enabled' => 'Администратора изисква двуфакторно удостоверяване да е активирано за акаунта ти за да използваш панела.',
];
