<?php

return [
    'heading' => 'Ласкаво просимо до Pelican!',
    'version' => 'Версія: :version',
    'advanced' => 'Розширені налаштування',
    'server' => 'Сервер',
    'user' => 'Користувач',
    'sections' => [
        'intro-developers' => [
            'heading' => 'Інформація для розробників',
            'content' => 'Дякуємо, що випробовуєте версію для розробників!',
            'extra_note' => 'Якщо ви зіткнулися з проблемами, будь ласка, повідомте про них на GitHub.',
            'button_issues' => 'Створити проблему',
            'button_features' => 'Обговорити функції',
        ],
        'intro-update-available' => [
            'heading' => 'Доступне оновлення',
            'content' => ':latestVersion вже доступна! Ознайомтеся з нашою документацією, щоб оновити свою панель.',
            'button_changelog' => 'Що нового?',
        ],
        'intro-no-update' => [
            'heading' => 'Ваша панель останньої версії',
            'content' => 'Ви зараз використовуєте :version. Ваша панель останньої версії!',
        ],
        'intro-first-node' => [
            'heading' => 'Вузлів не знайдено',
            'content' => 'Здається, у вас ще немає налаштованих вузлів, але не хвилюйтеся! Натисніть кнопку дії, щоб створити перший вузол!',
            'extra_note' => 'Якщо ви зіткнулися з проблемами, будь ласка, повідомте про них на GitHub.',
            'button_label' => 'Створити перший вузол у Pelican',
        ],
        'intro-support' => [
            'heading' => 'Підтримайте Pelican',
            'content' => 'Дякуємо, що використовуєте Pelican! Цього вдалося досягти лише завдяки підтримці від вас, наших учасників та всіх інших користувачів!',
            'extra_note' => 'Ми вдячні за будь-яку підтримку від кожного з вас.',
            'button_translate' => 'Допомогти з перекладом',
            'button_donate' => 'Підтримати фінансово',
        ],
        'intro-help' => [
            'heading' => 'Потрібна допомога?',
            'content' => 'Спочатку перегляньте документацію! Якщо вам все ще потрібна допомога, приєднуйтеся до нашого Discord-сервера!',
            'button_docs' => 'Читати документацію',
        ],
    ],
];
