<?php

return [
    'nav_title' => 'Хости баз даних',
    'model_label' => 'Хост бази даних',
    'model_label_plural' => 'Хости баз даних',
    'table' => [
        'database' => 'База даних',
        'name' => 'Ім’я',
        'host' => 'Хост',
        'port' => 'Порт',
        'name_helper' => 'Якщо залишити порожнім, буде автоматично згенеровано випадкове ім’я',
        'username' => 'Ім\'я користувача',
        'password' => 'Пароль',
        'remote' => 'Дозволені підключення',
        'remote_helper' => 'Звідки дозволені підключення. Залиште порожнім, щоб дозволити підключення звідусіль.',
        'max_connections' => 'Максимальна кількість з\'єднань',
        'created_at' => 'Створено',
        'connection_string' => 'JDBC-рядок підключення',
    ],
    'error' => 'Помилка підключення до хоста',
    'host' => 'Хост',
    'host_help' => 'IP-адреса або доменне ім’я, яке використовується для підключення до цього MySQL-хоста з панелі для створення нових баз даних.',
    'port' => 'Порт',
    'port_help' => 'Порт, на якому працює MySQL для цього хоста.',
    'max_database' => 'Максимальна кількість баз даних',
    'max_databases_help' => 'Максимальна кількість баз даних, які можна створити на цьому хості. Якщо ліміт досягнуто, нові бази даних не можна створювати. Якщо залишити порожнім — без обмежень.',
    'display_name' => 'Відображуване ім’я',
    'display_name_help' => 'IP-адреса або доменне ім\'я, яке має відображатися кінцевому користувачеві.',
    'username' => 'Ім\'я користувача',
    'username_help' => 'Ім’я користувача облікового запису, який має достатньо прав для створення нових користувачів і баз даних у системі.',
    'password' => 'Пароль',
    'password_help' => 'Пароль для користувача бази даних.',
    'linked_nodes' => 'Пов’язані вузли',
    'linked_nodes_help' => 'Це налаштування використовується за замовчуванням для цього хоста бази даних при додаванні бази даних до сервера на вибраному вузлі.',
    'connection_error' => 'Помилка підключення до хоста бази даних',
    'no_database_hosts' => 'Немає хостів баз даних',
    'no_nodes' => 'Немає вузлів',
    'delete_help' => 'Хост бази даних містить бази даних',
    'unlimited' => 'Необмежено',
    'anywhere' => 'Будь-де',

    'rotate' => 'Оновити',
    'rotate_password' => 'Оновити пароль',
    'rotated' => 'Пароль оновлено',
    'rotate_error' => 'Помилка оновлення пароля',
    'databases' => 'Бази даних',

    'setup' => [
        'preparations' => 'Підготовка',
        'database_setup' => 'Налаштування бази даних',
        'panel_setup' => 'Налаштування панелі',

        'note' => 'Зараз підтримуються лише бази даних MySQL/ MariaDB для хостів!',
        'different_server' => 'Панель і база даних <i>не</i> на одному сервері?',

        'database_user' => 'Користувач бази даних',
        'cli_login' => 'Використовуйте <code>mysql -u root -p</code> для доступу до mysql cli.',
        'command_create_user' => 'Команда, що створює користувача',
        'command_assign_permissions' => 'Команда, що назначає дозволи',
        'cli_exit' => 'Для виходу з mysql cli запустіть <code>exit</code>.',
        'external_access' => 'Зовнішній доступ',
        'allow_external_access' => '
                                    <p>Швидше за все, вам потрібно буде дозволити зовнішній доступ до цього екземпляра MySQL, щоб дозволити серверам підключатися до нього.</p>
                                    <br>
                                    <p>Для цього відкрийте <code>my.cnf</code>, розташування якого залежить від вашої ОС і способу встановлення MySQL. Ви можете ввести find <code>/etc -iname my.cnf</code>, щоб знайти його.</p>
                                    <br>
                                    <p>Відкрийте <code>my.cnf</code>, додайте текст нижче внизу файлу та збережіть його:<br>
                                    <code>[mysqld]<br>bind-address=0.0.0.0</code></p>
                                    <br>
                                    <p>Перезапустіть MySQL/ MariaDB, щоб застосувати ці зміни. Це перевизначить стандартну конфігурацію MySQL, яка за замовчуванням прийматиме лише запити від localhost. Оновлення цього дозволить з’єднання на всіх інтерфейсах, а отже, зовнішні з’єднання. Переконайтеся, що дозволено порт MySQL (за замовчуванням 3306) у вашому брандмауері.</p>',
    ],
];
