<?php

return [
    'notices' => [
        'imported' => 'Яйце та його змінні успішно імпортовано.',
        'updated_via_import' => 'Яйце було оновлено з файлу.',
        'deleted' => 'Яйце було видалено з панелі.',
        'updated' => 'Налаштування яйця були успішно оновленні.',
        'script_updated' => 'Скрипт установки яйця був успішно оновлений і буде виконуватися під час встановлення серверів.',
        'egg_created' => 'Нове яйце було успішно створено. Щоб застосувати це нове яйце Вам знадобиться перезавантажити Wings.',
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'Змінна ":variable" була видалена і більше не є доступна для серверів після перезавантаження.',
            'variable_updated' => 'Змінна ":variable" була оновлена. Вам знадобиться перезавантажити будь-які сервери які використовують цю змінну щоб зміни ввійшли в силу.',
            'variable_created' => 'Нову змінну успішно створено та призначено цьому яйцю.',
        ],
    ],
];
