<?php

return [
    'nav_title' => 'Точки монтування',
    'model_label' => 'Точка монтування',
    'model_label_plural' => 'Точки монтування',
    'name' => 'Назва',
    'name_help' => 'Унікальна назва, яка використовується для відокремлення цієї точки монтування від інших.',
    'source' => 'Джерело',
    'source_help' => 'Шлях до файлу на хост-системі, який потрібно змонтувати в контейнер.',
    'target' => 'Цільове розташування',
    'target_help' => 'Де ця точка монтування буде доступна всередині контейнера.',
    'read_only' => 'Тільки для читання?',
    'read_only_help' => 'Чи буде ця точка монтування доступною тільки для читання в контейнері?',
    'description' => 'Опис',
    'description_help' => 'Детальний опис цієї точки монтування.',
    'no_mounts' => 'Немає точок монтування',
    'eggs' => 'Яйця',
    'nodes' => 'Вузли',
    'toggles' => [
        'writable' => 'Доступний для запису',
        'read_only' => 'Тільки для читання',
    ],
    'table' => [
        'name' => 'Назва',
        'all_eggs' => 'Усі яйця',
        'all_nodes' => 'Усі вузли',
        'read_only' => 'Тільки для читання',
    ],
];
