<?php

return [
    'validation' => [
        'fqdn_not_resolvable' => 'Наданий домен або IP-адреса не перетворюється на дійсну IP-адресу.',
        'fqdn_required_for_ssl' => 'Щоб використовувати SSL для цього вузла, потрібне повне доменне ім’я, яке перетворюється на дійсну загальнодоступну IP-адресу.',
    ],
    'notices' => [
        'allocations_added' => 'Призначення успішно додано до цього вузла.',
        'node_deleted' => 'Вузол було успішно видалено з панелі.',
        'node_created' => 'Успішно створений новий вузол. Ви можете автоматично налаштувати демон на ньому, відвідавши вкладку \'Налаштування\'. <strong>Перед доданням будь-яких серверів, ви повинні спочатку виділити хоча б одну IP адресу та порт.</strong>',
        'node_updated' => 'Інформація вузла була успішно оновлена. Якщо Ви змінили налаштування демона, то Вам необхідно перезапустити вузол для застосування змін.',
        'unallocated_deleted' => 'Видалено всі невиділені порти для <code>:ip</code>.',
    ],
];
