<?php

return [
    'nav_title' => 'Користувачі',
    'model_label' => 'Користувач',
    'model_label_plural' => 'Користувачі',
    'self_delete' => 'Не можна видалити власний акаунт',
    'has_servers' => 'Користувач має сервери',
    'email' => 'Електронна пошта',
    'username' => 'Ім\'я користувача',
    'password' => 'Пароль',
    'password_help' => 'Вказівка пароля є необов’язковою. Новий користувач отримає електронний лист із запитом на створення пароля під час першого входу.',
    'admin_roles' => 'Адміністративні ролі',
    'roles' => 'Ролі',
    'no_roles' => 'Немає ролей',
    'servers' => 'Сервери',
    'subusers' => 'Субкористувачі',
];
