<?php

return [
    'user' => [
        'search_users' => 'Въведете потребителско име, потребителско ID или имейл адрес',
        'select_search_user' => 'ID на потребителя за изтриване (Въведете \'0\' за повторно търсене)',
        'deleted' => 'Потребителят бе изтрит успешно от панела.',
        'confirm_delete' => 'Сигурни ли сте че искате да изтриете този потребител от панела?',
        'no_users_found' => 'Не бяха намерени потребители с предоставената дума за търсене.',
        'multiple_found' => 'Няколко акаунта бяха намерени за този потребител, не може да се изтрие потребител заради --no-interaction флага.',
        'ask_admin' => 'Този потребител администратор ли е?',
        'ask_email' => 'Имейл адрес',
        'ask_username' => 'Потребителско име',
        'ask_password' => 'Парола',
        'ask_password_tip' => 'Ако искате да създадете акаунт с рандомизирана парола изпратена до имейла на потребителя, изпълнете отново тази команда (CTRL+C) и подайте флага `--no-password`.',
        'ask_password_help' => 'Паролите трябва да са поне 8 знака дълги и да имат поне една главна буква и число.',
        '2fa_help_text' => 'Тази команда ще изключи дву-факторното удостоверяване за акаунта на потребителя ако е включено. Това трябва да се използва само като команда за възстановяване на акаунта, ако потребителят няма достъп до акаунтът си. Ако не искате това, натиснете CTRL+C за да спрете този процес.',
        '2fa_disabled' => 'Дву-факторното удостоверяване е деактивирано за :email.',
    ],
    'schedule' => [
        'output_line' => 'Изпращане на процес за първата задача в `:schedule` (:id).',
    ],
    'maintenance' => [
        'deleting_service_backup' => 'Изтриване на резервен файл на услугата :file.',
    ],
    'server' => [
        'rebuild_failed' => 'Заявката за възстановяване на ":name" (#:id) на възел ":node" е неуспешна с грешка: :message',
        'reinstall' => [
            'failed' => 'Заявката за преинсталиране на ":name" (#:id) на възел ":node" е неуспешна с грешка: :message',
            'confirm' => 'Предстои преинсталиране на група сървъри. Искате ли да продължите?',
        ],
        'power' => [
            'confirm' => 'Предстои ви да извършите :action срещу :count сървъри. Искате ли да продължите?',
            'action_failed' => 'Заявката за захранващо действие на ":name" (#:id) на възел ":node" е неуспешна с грешка: :message',
        ],
    ],
    'environment' => [
        'mail' => [
            'ask_smtp_host' => 'SMTP хост (пример smtp.gmail.com)',
            'ask_smtp_port' => 'SMTP порт',
            'ask_smtp_username' => 'SMTP потребител',
            'ask_smtp_password' => 'SMTP парола',
            'ask_mailgun_domain' => 'Mailgun домейн',
            'ask_mailgun_endpoint' => 'Mailgun крайна точка',
            'ask_mailgun_secret' => 'Mailgun тайна',
            'ask_mandrill_secret' => 'Mandrill тайна',
            'ask_postmark_username' => 'Postmark API ключ',
            'ask_driver' => 'Кой драйвер трябва да се използва за изпращане на имейли?',
            'ask_mail_from' => 'Имейл адрес, от който трябва да идват имейлите',
            'ask_mail_name' => 'Име от което трябва да идват имейлите',
            'ask_encryption' => 'Метод за криптиране, който да използвате',
        ],
    ],
];
