<?php

return [
    'title' => 'Резервні копії',
    'empty' => 'Немає резервних копій',
    'size' => 'Розмір',
    'created_at' => 'Дата створення',
    'status' => 'Стан',
    'is_locked' => 'Статус блокування',
    'backup_status' => [
        'in_progress' => 'У процесі...',
        'successful' => 'Успішно',
        'failed' => 'Помилка',
    ],
    'actions' => [
        'create' => [
            'title' => 'Створити резервну копію',
            'limit' => 'Досягнуто ліміт резервних копій',
            'created' => ':name створено',
            'notification_success' => 'Резервну копію вдало створено',
            'notification_fail' => 'Помилка створення резервної копії',
            'name' => 'Ім’я',
            'ignored' => 'Ігноровані файли та каталоги',
            'locked' => 'Заблоковано?',
            'lock_helper' => 'Запобігає видаленню цієї резервної копії поки не буде знято блокування для видалення.',
        ],
        'lock' => [
            'lock' => 'Блокувати',
            'unlock' => 'Розблокувати',
        ],
        'download' => 'Завантажити',
        'rename' => [
            'title' => 'Перейменувати',
            'new_name' => 'Ім\'я резервної копії',
            'notification_success' => 'Резервну копію успішно відновлено',
        ],
        'restore' => [
            'title' => 'Відновити',
            'helper' => 'Ваш сервер буде зупинено. Ви не зможете контролювати стан живлення, доступ до файлового менеджера або створення додаткових резервних копій до завершення процесу.',
            'delete_all' => 'Видалити всі файли перед відновленням резервної копії?',
            'notification_started' => 'Відновлення з резервної копії',
            'notification_success' => 'Резервну копію успішно відновлено',
            'notification_fail' => 'Помилка відновлення з резервної копії',
            'notification_fail_body_1' => 'Цей сервер зараз не перебуває у стані, який дозволяє відновити резервну копію.',
            'notification_fail_body_2' => 'Цю резервну копію не можна відновити зараз: не завершено або не вдалося відновити.',
        ],
        'delete' => [
            'title' => 'Видалити резервну копію',
            'description' => 'Бажаєте видалити :backup?',
            'notification_success' => 'Резервна копія видалена',
            'notification_fail' => 'Не вдалося видалити резервну копію',
            'notification_fail_body' => 'Помилка підключення до вузла. Будь ласка, спробуйте ще раз.',
        ],
    ],
];
