<?php

return [
    'title' => 'Консоль',
    'command' => 'Введіть команду...',
    'command_blocked' => 'Сервер офлайн...',
    'command_blocked_title' => 'Не вдається надіслати команду, якщо сервер знаходиться офлайн',
    'open_in_admin' => 'Відкрити в адмін панелі',
    'power_actions' => [
        'start' => 'Запустити',
        'stop' => 'Зупинити',
        'restart' => 'Перезапустити',
        'kill' => 'Завершити',
        'kill_tooltip' => 'Це може призвести до пошкодження даних і/або втрати даних!',
    ],
    'labels' => [
        'cpu' => 'ЦП',
        'memory' => 'Памʼять',
        'network' => 'Мережа',
        'disk' => 'Диск',
        'name' => 'Ім’я',
        'status' => 'Статус',
        'address' => 'Адреса',
        'unavailable' => 'Недоступно',
    ],
    'status' => [
        'created' => 'Створено',
        'starting' => 'Запускається',
        'running' => 'Працює',
        'restarting' => 'Перезавантаження',
        'exited' => 'Вихід',
        'paused' => 'Призупинено',
        'dead' => 'Помер',
        'removing' => 'Видалення',
        'stopping' => 'Зупиняється',
        'offline' => 'Офлайн',
        'missing' => 'Відсутні',
    ],
    'websocket_error' => [
        'title' => 'Не вдалося підключитися до веб-сокету!',
        'body' => 'Перевірте вашу консоль браузера для більш детальної інформації.',
    ],
];
