<?php

return [
    'title' => 'Розклади',
    'new' => 'Новий Розклад',
    'edit' => 'Редагувати розклад',
    'save' => 'Зберегти розклад',
    'delete' => 'Видалити розклад',
    'import' => 'Імпортувати розклад',
    'export' => 'Експортувати розклад',
    'name' => 'Назва',
    'cron' => 'Планувальник',
    'status' => 'Стан',
    'schedule_status' => [
        'inactive' => 'Неактивний',
        'processing' => 'Виконується',
        'active' => 'Активний',
    ],
    'no_tasks' => 'Немає завдань',
    'run_now' => 'Запустити зараз',
    'online_only' => 'Тільки в режимі онлайн',
    'last_run' => 'Останній запуск',
    'next_run' => 'Наступний запуск',
    'never' => 'Ніколи',
    'cancel' => 'Скасувати',

    'only_online' => 'Лише коли на сервері працює?',
    'only_online_hint' => 'Виконувати тільки цей розклад, коли сервер працює.',
    'enabled' => 'Увімкнути розклад?',
    'enabled_hint' => 'Цей розклад буде виконано автоматично, якщо увімкнено.',

    'cron_body' => 'Будь ласка, майте на увазі, що крон подано нижче значення UTC.',
    'cron_timezone' => 'Наступний запуск у часовому поясі (:timezone): <b> :next_run </b>',

    'invalid' => 'Недійсний',

    'time' => [
        'minute' => 'Хвилина',
        'hour' => 'Година',
        'day' => 'День',
        'week' => 'Тиждень',
        'month' => 'Місяць',
        'day_of_month' => 'День місяця',
        'day_of_week' => 'День тижня',

        'hourly' => 'Щогодини',
        'daily' => 'Щоденно',
        'weekly_mon' => 'Щотижневий (понеділок)',
        'weekly_sun' => 'Щотижневий (неділя)',
        'monthly' => 'Щомісяця',
        'every_min' => 'Кожні x хвилин',
        'every_hour' => 'Кожні x годин',
        'every_day' => 'Кожні x днів',
        'every_week' => 'Кожні x тижнів',
        'every_month' => 'Кожні x місяців',
        'every_day_of_week' => 'Кожного дня тижня',

        'every' => 'Кожен',
        'minutes' => 'Хвилини',
        'hours' => 'Години',
        'days' => 'Дні',
        'months' => 'Місяці',

        'monday' => 'Понеділок',
        'tuesday' => 'Вівторок',
        'wednesday' => 'Середа',
        'thursday' => 'Четвер',
        'friday' => 'П’ятниця',
        'saturday' => 'Субота',
        'sunday' => 'Неділя',
    ],

    'tasks' => [
        'title' => 'Завдання',
        'create' => 'Створити завдання',
        'limit' => 'Досягнуто ліміту завдань',
        'action' => 'Дія',
        'payload' => 'Корисне навантаження',
        'no_payload' => 'Дані Payload відсутні',
        'time_offset' => 'Часовий пояс',
        'first_task' => 'Перше завдання',
        'seconds' => 'Секунди',
        'continue_on_failure' => 'Продовжити при помилці',

        'actions' => [
            'title' => 'Дія',
            'power' => [
                'title' => 'Відправити дії живлення',
                'action' => 'Дії живлення',
                'start' => 'Запустити',
                'stop' => 'Зупинити',
                'restart' => 'Перезапустити',
                'kill' => 'Завершити',
            ],
            'command' => [
                'title' => 'Надіслати команду',
                'command' => 'Команда',
            ],
            'backup' => [
                'title' => 'Створити резервну копію',
                'files_to_ignore' => 'Файли для ігнорування',
            ],
            'delete_files' => [
                'title' => 'Видалити файли',
                'files_to_delete' => 'Файли для видалення',
            ],
        ],
    ],

    'notification_invalid_cron' => 'Надані дані cron не обчислюються для правильного виразу',

    'import_action' => [
        'file' => 'Файл',
        'url' => 'URL',
        'schedule_help' => 'Це має бути безпосередньо .json файл (наприклад, schedule-daily-restart.json)',
        'url_help' => 'URL-адреси мають вказувати безпосередньо на необроблений .json файл.',
        'add_url' => 'Нова URL-адреса',
        'import_failed' => 'Імпорт не вдався',
        'import_success' => 'Імпорт успішний',
    ],
];
