<?php

return [
    'daemon_connection_failed' => 'Имаше изключение при опит за комуникация с daemon-а с код HTTP/:code. Това изключение бе записано.',
    'node' => [
        'servers_attached' => 'Този node не трябва да има сървъри на него за да се изтрие.',
        'error_connecting' => 'Проблем при свързването с :node',
        'daemon_off_config_updated' => 'Конфигурацията на daemon-а <strong>бе актуализирана</strong>, обаче възникна проблем при опит за автоматично актуализиране на конфигурационния файл на daemon-а. Ще трябва ръчно да актуализираш конфигорационния файл (config.yml) за да може daemon-а да приложи тези промени.',
    ],
    'allocations' => [
        'server_using' => 'В момента е назначен сървър към тази алокация. Алокацията може да се изтрие само когато не е назначен сървър към нея.',
        'too_many_ports' => 'Добавяне на над 1000 порта в единствен диапазон не се поддържа.',
        'invalid_mapping' => 'Зададеното съпоставяне за :port е невалидно и не може да бъде обработено.',
        'cidr_out_of_range' => 'CIDR нотацията позволява само маски между /25 и /32',
        'port_out_of_range' => 'Портовете в разпределението трябва да са по-голям или равен на 1024 и по-малък или равен на 65535.',
    ],
    'egg' => [
        'delete_has_servers' => 'Egg с назначени активни сървъри към него не може да се изтрие от панела.',
        'invalid_copy_id' => 'Яйцето, избрано за копиране на скрипт, или не съществува, или самото то копира скрипт.',
        'has_children' => 'Това Яйце е родител на едно или повече други Яйца. Моля, изтрийте тези Яйца, преди да изтриете това Яйце.',
    ],
    'variables' => [
        'env_not_unique' => 'Променливата на средата :name трябва да бъде уникална за това Яйце.',
        'reserved_name' => 'Променливата на средата :name е защитена и не може да бъде зададена на променлива.',
        'bad_validation_rule' => 'Правилото за валидиране ":rule" не е валидно правило за това приложение.',
    ],
    'importer' => [
        'json_error' => 'Имаше грешка при опита за анализ на JSON файла: :error.',
        'file_error' => 'Даденият JSON файл не е валиден.',
        'invalid_json_provided' => 'Даденият JSON файл не е в разпознаем формат.',
    ],
    'subusers' => [
        'editing_self' => 'Редактирането на своя подпотребителски акаунт не е позволено.',
        'user_is_owner' => 'Не можеш да добавиш собственика на сървъра като подпотребител на този сървър.',
        'subuser_exists' => 'Потребител с този имейл адрес е вече подпотребител за този сървър.',
    ],
    'databases' => [
        'delete_has_databases' => 'Не може да се изтрие хост сървъра за бази данните, към който са свързани активни бази данни.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Максималната продължителност на интервала за верижна задача е 15 минути.',
    ],
    'locations' => [
        'has_nodes' => 'Не можеш да изтриеш локация с активни node-ове свързани към нея.',
    ],
    'users' => [
        'is_self' => 'Не можеш да изтриеш твоя собствен потребителски профил.',
        'has_servers' => 'Не можеш да изтриеш профил със свързани активни сървъри към него. Моля изтрийте техните сървъри преди да продължите.',
        'node_revocation_failed' => 'Неуспешно отнемане на ключовете на <a href=":link">Възел #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'Не бяха открити възли, отговарящи на изискванията, определени за автоматичен деплоймънт.',
        'no_viable_allocations' => 'Не бяха открити алокации, които да отговарят на изискванията за автоматичен деплоймънт.',
    ],
    'api' => [
        'resource_not_found' => 'Поисканият ресурс не съществува на този сървър.',
    ],
    'mount' => [
        'servers_attached' => 'Този node не трябва да има сървъри на него за да се изтрие',
    ],
    'server' => [
        'marked_as_failed' => 'Този сървър не е приключил инсталирания си процес, моля опитайте по-късно.',
    ],
];
