<?php

return [
    'heading' => 'Сардэчна запрашаем у Pelican!',
    'version' => 'Версія: :version',
    'advanced' => 'Дадатковыя',
    'server' => 'Сервер',
    'user' => 'Карыстальнік',
    'sections' => [
        'intro-developers' => [
            'heading' => 'Інфармацыя для Распрацоўшчыкаў
',
            'content' => 'Дзякуем, што паспрабавалі распрацоўчую версію!',
            'extra_note' => 'Калі ўзнікнуць якія-небудзь праблемы, калі ласка, паведаміце пра іх на GitHub.',
            'button_issues' => 'Апавясціць аб праблеме.',
            'button_features' => 'Абмеркаваць функцыі.',
        ],
        'intro-update-available' => [
            'heading' => 'Даступна абнаўленне.',
            'content' => ':latestVersion цяпер даступная! Прачытайце нашу дакументацыю, каб абнавіць вашу панэль.',
            'button_changelog' => 'Што новага?',
        ],
        'intro-no-update' => [
            'heading' => 'Ваша панэль абноўлена да актуальнай версіі.',
            'content' => 'Цяпер вы выкарыстоўваеце :version. Ваша панэль абноўлена!',
        ],
        'intro-first-node' => [
            'heading' => 'Вузлы не выяўленыя.',
            'content' => 'Здаецца, у вас яшчэ няма наладжаных вузлоў, але не хвалюйцеся — проста націсніце кнопку дзеяння, каб стварыць свой першы вузел!',
            'extra_note' => 'Калі ў вас узнікнуць якія-небудзь праблемы, калі ласка, паведаміце пра іх на GitHub.',
            'button_label' => 'Стварыце першы вузел у Pelican',
        ],
        'intro-support' => [
            'heading' => 'Падтрымка Pelican',
            'content' => 'Дзякуй за выкарыстанне Pelican! Гэта стала магчымым толькі дзякуючы падтрымцы вас, нашых удзельнікаў і ўсіх астатніх, хто нас падтрымлівае!',
            'extra_note' => 'Мы ўдзячныя кожнаму за любую падтрымку.',
            'button_translate' => 'Дапамагчы з перакладам',
            'button_donate' => 'Ахвяраваць напрамую',
        ],
        'intro-help' => [
            'heading' => 'Патрэбна дапамога?',
            'content' => 'Спачатку азнаёмцеся з дакументацыяй! Калі ўсё яшчэ патрэбна дапамога — заходзьце на наш Discord-сервер!',
            'button_docs' => 'Прачытаць дакументацыю',
        ],
    ],
];
