<?php

return [
    'nav_title' => 'Базы даных',
    'model_label' => 'База даных',
    'model_label_plural' => 'Хост базы даных',
    'table' => [
        'database' => 'База даных',
        'name' => 'Імя',
        'host' => 'Хост',
        'port' => 'Порт',
        'name_helper' => 'Калі пакінуць гэта поле пустым, імя будзе створана аўтаматычна.',
        'username' => 'Ідэнтыфікатар карыстальніка',
        'password' => 'Пароль',
        'remote' => 'Падключэнні з',
        'remote_helper' => 'Адкуль павінны дазваляцца падключэнні. Пакіньце пустым, каб дазволіць іх з любога месца.',
        'max_connections' => 'Максімальная колькасць злучэнняў',
        'created_at' => 'Створана ў',
        'connection_string' => 'Радок падключэння да JDBC',
    ],
    'error' => 'Памылка пры падключэнні з хостам',
    'host' => 'Хост',
    'host_help' => 'IP-адрас або даменнае імя, якое павінна выкарыстоўвацца пры спробе падключэння з гэтым хостам MySQL з панэлі для стварэння новых баз даных.',
    'port' => 'Порт',
    'port_help' => 'Порт, на якім працуе MySQL для гэтага хоста.',
    'max_database' => 'Максімальная колькасць баз даных',
    'max_databases_help' => 'Максімальная колькасць баз дадзеных, якія можна стварыць на гэтым хосце. Калі ліміт дасягнуты, новыя базы дадзеных на гэтым хосце ствараць нельга. Пустое значэнне — без абмежавання.',
    'display_name' => 'Назва',
    'display_name_help' => 'IP-адрас або даменнае імя, якое павінна адлюстроўвацца для канчатковага карыстальніка.',
    'username' => 'Имя пользователя',
    'username_help' => 'Ідэнтыфікатар карыстальніка ўліковага запісу, які мае дастатковыя правы для стварэння новых карыстальнікаў і баз даных у сістэме.',
    'password' => 'Пароль',
    'password_help' => 'Пароль да карыстальніка базы даных.',
    'linked_nodes' => 'Звязаныя вузлы',
    'linked_nodes_help' => 'Гэта налада выкарыстоўваецца па змаўчанні толькі для гэтага хоста базы даных пры даданні базы на сервер, што знаходзіцца на выбраным вузле.',
    'connection_error' => 'Памылка пры падключэнні з хостам базы даных',
    'no_database_hosts' => 'Няма хостаў базы даных',
    'no_nodes' => 'Няма вузлоў',
    'delete_help' => 'Хост базы дадзеных ужо ўтрымлівае базы даных',
    'unlimited' => 'Без абмежавання',
    'anywhere' => 'З любога месца',

    'rotate' => 'Павярнуць',
    'rotate_password' => 'Абнавіць пароль',
    'rotated' => 'Пароль абноўлены',
    'rotate_error' => 'Не атрымалася абнавіць пароль',
    'databases' => 'Базы данных',

    'setup' => [
        'preparations' => 'Падрыхтоўка',
        'database_setup' => 'Устаноўка базы даных',
        'panel_setup' => 'Устаноўка панэлі',

        'note' => 'На дадзены момант падтрымліваюцца толькі базы MySQL / MariaDB!',
        'different_server' => 'Панэль і база даных <i>не</i> знаходзяцца на адным серверы?',

        'database_user' => 'Карыстальнік базы даных',
        'cli_login' => 'Выкарыстай <code>mysql -u root -p</code>, каб атрымаць доступ да mysql cli.',
        'command_create_user' => 'Каманда для стварэння карыстальніка',
        'command_assign_permissions' => 'Каманда для прызначэння разрашэнняў',
        'cli_exit' => 'Каб выйсці з mysql cli, увядзіце <code>exit</code>.',
        'external_access' => 'Знешні доступ',
        'allow_external_access' => '
                                    <p>Скорэй за ўсё, табе спатрэбіцца дазволіць знешні доступ да гэтай інстанцыі MySQL, каб серверы маглі падключацца да яе.</p>
                                    <br>
                                    <p>Для гэтага адкрый файл <code>my.cnf</code>, які можа знаходзіцца ў розных месцах у залежнасці ад аперацыйнай сістэмы і спосабу ўстаноўкі MySQL. Ты можаш увесці каманду <code>find /etc -iname my.cnf</code>, каб знайсці яго.</p>
                                    <br>
                                    <p>Адкрый <code>my.cnf</code>, дадай наступны тэкст у канец файла і запішы змены:<br> <code>[mysqld]<br>bind-address=0.0.0.0</code></p>
                                    <br>
                                    <p>Перазапусці MySQL або MariaDB, каб прымяніць змены. Гэта зменіць стандартную канфігурацыю MySQL, якая па змаўчанні прымае злучэнні толькі з localhost. Пасля абнаўлення канфігурацыі сервер зможа прымаць злучэнні на ўсіх інтэрфейсах, у тым ліку і знешнія. Абавязкова дазволь порт MySQL (па змаўчанні 3306) у брандмаўэры.</p>',
    ],
];
