<?php

return [
    'nav_title' => 'Маунты',
    'model_label' => 'Маунт',
    'model_label_plural' => 'Маунты',
    'name' => 'Імя',
    'name_help' => 'Унікальнае імя, якое выкарыстоўваецца для аддзялення гэтага маунта ад іншых.',
    'source' => 'Крыніца',
    'source_help' => 'Шлях да файла на сістэме для маунта ў кантэйнер.',
    'target' => 'Месца прызначэння',
    'target_help' => 'Месца, дзе маунт будзе даступны ўнутры кантэйнера.',
    'read_only' => 'Толькі для чытання?',
    'read_only_help' => 'Ці з\'яўляецца маунт толькі для чытання ўнутры кантэйнера?',
    'description' => 'Апісанне',
    'description_help' => 'Больш падрабязнае апісанне для гэтага маунта',
    'no_mounts' => 'Няма маунтаў',
    'eggs' => 'Вобразы',
    'nodes' => 'Вузлы',
    'toggles' => [
        'writable' => 'Даступна для запісу',
        'read_only' => 'Толькі для чытання',
    ],
    'table' => [
        'name' => 'Імя',
        'all_eggs' => 'Усе вобразы',
        'all_nodes' => 'Усе вузлы',
        'read_only' => 'Толькі для чытання',
    ],
];
