<?php

return [
    'nav_title' => 'Карыстальнікі',
    'model_label' => 'Карыстальнік',
    'model_label_plural' => 'Карыстальнікі',
    'self_delete' => 'Нельга выдаліць сябе',
    'has_servers' => 'Карыстальнік мае серверы',
    'email' => 'Пошта',
    'username' => 'Имя пользователя',
    'password' => 'Пароль',
    'password_help' => 'Прапанаванне пароля карыстальніка з\'яўляецца неабавязковым. Электронная пошта новага карыстальніка падказвае стварыць пароль пры першым уводзе.',
    'admin_roles' => 'Ролі адміністратара',
    'roles' => 'Ролі',
    'no_roles' => 'Няма роляў',
    'servers' => 'Серверы',
    'subusers' => 'Падкарыстальнікі',
];
