<?php

return [
    'title' => 'Επισκόπηση Λογαριασμού',
    'email' => [
        'title' => 'Ενημερώστε το email σας',
        'button' => 'Ενημέρωση Email',
        'updated' => 'Η διεύθυνση email σας ενημερώθηκε.',
    ],
    'password' => [
        'title' => 'Αλλάξτε τον κωδικό πρόσβασής σας',
        'button' => 'Ενημέρωση κωδικού πρόσβασης',
        'requirements' => 'Ο νέος κωδικός πρόσβασης πρέπει να έχει μήκος τουλάχιστον 8 χαρακτήρων.',
        'validation' => [
            'account_password' => 'Πρέπει να συμπληρώσετε τον κωδικό πρόσβασης του λογαριασμού σας.',
            'current_password' => 'Πρέπει να συμπληρώσετε τον τρέχοντα κωδικό πρόσβασής σας.',
            'password_confirmation' => 'Η επιβεβαίωση κωδικού πρόσβασης δεν ταιριάζει με τον κωδικό πρόσβασης που εισαγάγατε.',
        ],
        'updated' => 'Ο κωδικός πρόσβασης σας ενημερώθηκε.',
    ],
    'two_factor' => [
        'title' => 'Επαλήθευση Δύο Βημάτων',
        'button' => 'Ρύθμιση Ελέγχου Ταυτότητας 2 Παραγόντων',
        'disabled' => 'Ο έλεγχος ταυτότητας δύο παραγόντων έχει απενεργοποιηθεί στο λογαριασμό σας. Δεν θα σας ζητηθεί πλέον να παρέχετε ένα διακριτικό κατά τη σύνδεση.',
        'enabled' => 'Ο έλεγχος ταυτότητας δύο παραγόντων ενεργοποιήθηκε στο λογαριασμό σας! Από δω και στο εξής, όταν θέλετε να συνδεθείτε, θα πρέπει να παρέχετε τον κωδικό που δημιουργείται από τη συσκευή σας.',
        'invalid' => 'Το παρεχόμενο διακριτικό δεν ήταν έγκυρο.',
        'enable' => [
            'help' => 'Δεν έχετε ενεργοποιήσει την επαλήθευση δύο βημάτων στο λογαριασμό σας. Κάντε κλικ στο παρακάτω κουμπί για να ξεκινήσετε τη ρύθμιση.',
            'button' => 'Ενεργοποίηση Επαλήθευσης Δύο Βημάτων',
        ],
        'disable' => [
            'help' => 'Η επαλήθευση δύο βημάτων είναι ενεργοποιημένη στο λογαριασμό σας.',
            'title' => 'Απενεργοποίηση ελέγχου ταυτότητας δύο παραγόντων',
            'field' => 'Εισαγωγή διακριτικού',
            'button' => 'Απενεργοποίηση Επαλήθευσης Δύο Βημάτων',
        ],
        'setup' => [
            'title' => 'Ρύθμιση ελέγχου ταυτότητας δύο παραγόντων',
            'subtitle' => 'Βοηθήστε στην προστασία του λογαριασμού σας από μη εξουσιοδοτημένη πρόσβαση. Θα σας ζητείται ένας κωδικός επαλήθευσης κάθε φορά που συνδέεστε.',
            'help' => 'Δεν είναι δυνατή η σάρωση του κωδικού; Εισάγετε τον παρακάτω κωδικό στην εφαρμογή σας:',
        ],

        'required' => [
            'title' => 'Η επαλήθευση δύο παραγόντων απαιτείται',
            'description' => 'Ο λογαριασμός σας πρέπει να έχει ενεργοποιημένο τον έλεγχο ταυτότητας δύο παραγόντων για να συνεχίσετε.',
        ],
    ],
];
