<?php

return [
    'email' => [
        'title' => 'Ενημέρωση email',
        'updated' => 'Η διεύθυνση email σας έχει ενημερωθεί.',
    ],
    'password' => [
        'title' => 'Αλλαγή κωδικού πρόσβασης',
        'requirements' => 'Ο νέος κωδικός πρόσβασης πρέπει να έχει μήκος τουλάχιστον 8 χαρακτήρων.',
        'updated' => 'Ο κωδικός πρόσβασης σας ενημερώθηκε.',
    ],
    'two_factor' => [
        'button' => 'Ρύθμιση Ελέγχου Ταυτότητας 2 Παραγόντων',
        'disabled' => 'Ο έλεγχος ταυτότητας δύο παραγόντων έχει απενεργοποιηθεί στο λογαριασμό σας. Δεν θα σας ζητηθεί πλέον να παρέχετε ένα διακριτικό κατά τη σύνδεση.',
        'enabled' => 'Ο έλεγχος ταυτότητας δύο παραγόντων ενεργοποιήθηκε στο λογαριασμό σας! Από δω και στο εξής, όταν θέλετε να συνδεθείτε, θα πρέπει να παρέχετε τον κωδικό που δημιουργείται από τη συσκευή σας.',
        'invalid' => 'Το παρεχόμενο διακριτικό δεν ήταν έγκυρο.',
        'setup' => [
            'title' => 'Ρύθμιση ελέγχου ταυτότητας δύο παραγόντων',
            'help' => 'Δεν είναι δυνατή η σάρωση του κωδικού; Εισάγετε τον παρακάτω κωδικό στην εφαρμογή σας:',
            'field' => 'Εισαγωγή διακριτικού',
        ],
        'disable' => [
            'title' => 'Απενεργοποίηση ελέγχου ταυτότητας δύο παραγόντων',
            'field' => 'Εισαγωγή διακριτικού',
        ],
    ],
];
