<?php

return [
    'title' => 'Πίνακας Ελέγχου',
    'showing-your-servers' => 'Εμφάνιση των διακομιστών σας',
    'showing-others-servers' => 'Εμφάνιση των διακομιστών άλλων χρηστών',
    'no-other-servers' => 'Δεν υπάρχουν άλλοι διακομιστές για εμφάνιση.',
    'no-servers-associated' => 'Δεν υπάρχουν διακομιστές που να συνδεδεμένοι με τον λογαριασμό σας.',

    'content_tabs' => 'Καρτέλες περιεχόμενου',
    'overview' => 'Επισκόπηση',
    'heading' => 'Καλωσορίσατε στο Pelican!',
    'expand_sections' => 'Μπορείτε να επεκτείνετε τις ακόλουθες ενότητες:',
    'sections' => [
        'intro-developers' => [
            'heading' => 'Πληροφορίες για Προγραμματιστές',
            'content' => 'Σας ευχαριστούμε που δοκιμάζετε το development version!',
            'extra_note' => 'Αν αντιμετωπίσετε οποιαδήποτε προβλήματα, παρακαλούμε να τα αναφέρετε στο GitHub.',
            'button_issues' => 'Αναφορά προβλήματος',
            'button_features' => 'Συζήτηση Χαρακτηριστικών',
        ],
        'intro-first-node' => [
            'heading' => 'Δεν Ανιχνεύθηκαν Nodes',
            'content' => 'Φαίνεται ότι δεν έχετε κανέναν node ρυθμισμένο ακόμα, αλλά μην ανησυχείτε επειδή μπορείτε κάνετε κλικ στο κουμπί action για να δημιουργήσετε το πρώτο σας node!',
            'extra_note' => 'Αν αντιμετωπίσετε οποιαδήποτε προβλήματα, παρακαλούμε να τα αναφέρετε στο GitHub.',
            'button_label' => 'Δημιουργία πρώτου node στο Pelican',
        ],
        'intro-support' => [
            'heading' => 'Υποστηρίξτε το Pelican',
            'content' => 'Σας ευχαριστώ που χρησιμοποιείτε το Pelican, αυτό θα μπορούσε να επιτευχθεί μόνο με την υποστήριξη σας, των contributors μας και των υπολοίπων υποστηρικτών μας!',
            'extra_note' => 'Εκτιμούμε οποιαδήποτε και κάθε υποστήριξη από οποιονδήποτε.',
            'button_translate' => 'Βοηθήστε στη Μετάφραση',
            'button_donate' => 'Άμεση Δωρεά',
        ],
        'intro-help' => [
            'heading' => 'Χρειάζεστε βοήθεια;',
            'content' => 'Ελέγξτε πρώτα το documentation! Αν εξακολουθείτε να χρειάζεστε βοήθεια, πετάξτε μέχρι το διακομιστή μας στο Discord!',
            'button_docs' => 'Διαβάστε το Documentation',
            'button_discord' => 'Λάβετε βοήθεια στο Discord',
        ],
    ],

    'search' => 'Αναζήτηση διακομιστών...',
    'no_matches' => 'Δεν βρέθηκαν διακομιστές που να ταιριάζουν στα κριτήρια αναζήτησης.',
    'cpu_title' => 'Επεξεργαστής',
    'memory_title' => 'Μνήμη',
];
