<?php

return [
    'sign_in' => 'Σύνδεση',
    'go_to_login' => 'Μεταβείτε στη σελίδα σύνδεσης',
    'failed' => 'Δεν βρέθηκε λογαριασμός που να ταιριάζει με αυτά τα στοιχεία.',

    'forgot_password' => [
        'label' => 'Ξεχάσατε το κωδικό σας;',
        'label_help' => 'Εισάγετε τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας και θα σας στείλουμε οδηγίες για να επαναφέρετε τον κωδικό πρόσβασης σας.',
        'button' => 'Ανάκτηση Λογαριασμού',
    ],

    'reset_password' => [
        'button' => 'Επαναφορά και σύνδεση',
    ],

    'two_factor' => [
        'label' => 'Διακριτικό 2 Παραγόντων',
        'label_help' => 'Αυτός ο λογαριασμός απαιτεί ένα δεύτερο επίπεδο ελέγχου ταυτότητας για να συνεχίσετε. Παρακαλώ εισάγετε τον κωδικό που δημιουργήθηκε από τη συσκευή σας για να ολοκληρώσετε αυτήν τη σύνδεση.',
        'checkpoint_failed' => 'Το διακριτικό ελέγχου ταυτότητας δύο παραγόντων δεν ήταν έγκυρο.',
    ],

    'throttle' => 'Πάρα πολλές προσπάθειες σύνδεσης. Παρακαλώ δοκιμάστε ξανά σε :seconds δευτερόλεπτα.',
    'password_requirements' => 'Ο κωδικός πρόσβασης πρέπει να είναι τουλάχιστον 8 χαρακτήρες σε μήκος και θα πρέπει να είναι μοναδικός σε αυτό τη σελίδα.',
    '2fa_must_be_enabled' => 'Ο διαχειριστής απαιτεί την ενεργοποίηση του ελέγχου ταυτότητας δύο παραγόντων για τον λογαριασμό σας ώστε να χρησιμοποιήσετε τον πίνακα ελέγχου.',
];
