<?php

return [
    'return_to_login' => 'Επιστροφή στην σελίδα Σύνδεσης',
    'failed' => 'Δεν βρέθηκε λογαριασμός που να ταιριάζει με αυτά τα στοιχεία.',

    'login' => [
        'title' => 'Συνδεθείτε για να συνεχίσετε',
        'button' => 'Σύνδεση',
        'required' => [
            'username_or_email' => 'Πρέπει να παρέχεται ένα όνομα χρήστη ή email.',
            'password' => 'Παρακαλούμε εισάγετε τον κωδικό πρόσβασης του λογαριασμού σας.',
        ],
    ],

    'forgot_password' => [
        'title' => 'Αίτηση επαναφοράς κωδικού πρόσβασης',
        'label' => 'Ξεχάσατε το κωδικό σας;',
        'label_help' => 'Εισάγετε τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας και θα σας στείλουμε οδηγίες για να επαναφέρετε τον κωδικό πρόσβασης σας.',
        'button' => 'Ανάκτηση Λογαριασμού',
        'required' => [
            'email' => 'Πρέπει να παρέχεται μια έγκυρη διεύθυνση email για να συνεχίσετε.',
        ],
    ],

    'reset_password' => [
        'title' => 'Επαναφορά κωδικού πρόσβασης',
        'button' => 'Επαναφορά και σύνδεση',
        'new_password' => 'Νέος κωδικός πρόσβασης',
        'confirm_new_password' => 'Επιβεβαίωση νέου κωδικού πρόσβασης',
        'requirement' => [
            'password' => 'Οι κωδικοί πρόσβασης πρέπει να αποτελούνται από έξι χαρακτήρες τουλάχιστον.',
        ],
        'required' => [
            'password' => 'Ένας νέος κωδικός πρόσβασης απαιτείται.',
            'password_confirmation' => 'Ο νέος κωδικός πρόσβασης δεν ταιριάζει.',
        ],
        'validation' => [
            'password' => 'Ο νέος κωδικός πρόσβασης πρέπει να έχει μήκος τουλάχιστον 8 χαρακτήρων.',
            'password_confirmation' => 'Ο νέος κωδικός πρόσβασης δεν ταιριάζει.',
        ],
    ],

    'checkpoint' => [
        'title' => 'Σημείο Ελέγχου Συσκευής',
        'recovery_code' => 'Κωδικός Αποκατάστασης',
        'recovery_code_description' => 'Εισάγετε έναν από τους κωδικούς ανάκτησης που είχε δημιουργηθεί κατά την εγκατάσταση ελέγχου ταυτότητας 2 παραγόντων σε αυτόν τον λογαριασμό προκειμένου να συνεχίσετε.',
        'authentication_code' => 'Κωδικός επαλήθευσης',
        'authentication_code_description' => 'Εισάγετε το διακριτικό δύο παραγόντων που δημιουργήθηκε από τη συσκευή σας.',
        'button' => 'Συνεχίστε',
        'lost_device' => 'Έχω χάσει τη συσκευή μου',
        'have_device' => 'Έχω τη συσκευή μου',
    ],

    'two_factor' => [
        'label' => 'Διακριτικό 2 Παραγόντων',
        'label_help' => 'Αυτός ο λογαριασμός απαιτεί ένα δεύτερο επίπεδο ελέγχου ταυτότητας για να συνεχίσετε. Παρακαλώ εισάγετε τον κωδικό που δημιουργήθηκε από τη συσκευή σας για να ολοκληρώσετε αυτήν τη σύνδεση.',
        'checkpoint_failed' => 'Το διακριτικό ελέγχου ταυτότητας δύο παραγόντων δεν ήταν έγκυρο.',
    ],

    'throttle' => 'Πάρα πολλές προσπάθειες σύνδεσης. Παρακαλώ δοκιμάστε ξανά σε :seconds δευτερόλεπτα.',
    'password_requirements' => 'Ο κωδικός πρόσβασης πρέπει να είναι τουλάχιστον 8 χαρακτήρες σε μήκος και θα πρέπει να είναι μοναδικός σε αυτό τη σελίδα.',
    '2fa_must_be_enabled' => 'Ο διαχειριστής απαιτεί την ενεργοποίηση του ελέγχου ταυτότητας δύο παραγόντων για τον λογαριασμό σας ώστε να χρησιμοποιήσετε τον πίνακα ελέγχου.',
];
