<?php

return [
    'appsettings' => [
        'comment' => [
            'author' => 'Εισάγετε μια διεύθυνση email από την οποία θα πρέπει να εξάγονται τα eggs από αυτό το panel. Πρέπει να είναι μια έγκυρη διεύθυνση email.',
            'url' => 'Η διεύθυνση URL της εφαρμογής ΠΡΕΠΕΙ να ξεκινάει με https:// ή http:// ανάλογα με το αν χρησιμοποιείτε SSL ή όχι. Αν δεν περιλάβετε το scheme , τα emails και άλλο περιεχόμενο σας θα συνδέονται με τη λάθος τοποθεσία.',
            'timezone' => "Η ζώνη ώρας θα πρέπει να ταιριάζει με μία από τις υποστηριζόμενες ζώνες ώρας της PHP. Αν δεν είστε σίγουροι, παρακαλώ αναφερθείτε εδώ https://php.net/manual/en/timezones.php.",
            'settings_ui' => 'Ενεργοποίηση του UI based settings editor?',
        ],
        'redis' => [
            'note' => 'Έχετε επιλέξει το πρόγραμμα οδήγησης Redis για μία ή περισσότερες επιλογές, παρακαλώ δώστε έγκυρες πληροφορίες σύνδεσης παρακάτω. Στις περισσότερες περιπτώσεις μπορείτε να χρησιμοποιήσετε τις προεπιλογές που παρέχονται εκτός αν έχετε τροποποιήσει τις ρυθμίσεις σας.',
            'comment' => 'Από προεπιλογή, ένα Redis server instance δεν έχει κωδικό πρόσβασης καθώς εκτελείται τοπικά και δεν είναι προσβάσιμος στον έξω κόσμο. Εάν αυτή είναι η περίπτωση, απλά πατήστε enter χωρίς να εισάγετε κάποια τιμή.',
        ],
    ],
    'database_settings' => [
        'DB_HOST_note' => 'Συνιστάται ιδιαίτερα να μην χρησιμοποιείτε το "localhost" ως host της βάσης δεδομένων σας, καθώς έχουμε δει συχνά socket connection issues. Αν θέλετε να χρησιμοποιήσετε ένα local connection, θα πρέπει να χρησιμοποιήσετε "127.0.0.1".',
        'DB_USERNAME_note' => "Η χρήση του λογαριασμού root για συνδέσεις MySQL όχι μόνο είναι ιδιαίτερα αποθαρρυντικές, αλλά επίσης δεν επιτρέπεται και από αυτήν την εφαρμογή. Θα πρέπει να έχετε δημιουργήσει έναν χρήστη MySQL για αυτό το λογισμικό.",
        'DB_PASSWORD_note' => 'Φαίνεται ότι έχετε ήδη έναν κωδικό πρόσβασης σύνδεσης MySQL, θα θέλατε να τον αλλάξετε?',
        'DB_error_2' => 'Τα διαπιστευτήρια σύνδεσης σας ΔΕΝ έχουν αποθηκευτεί. Θα πρέπει να παρέχετε έγκυρες πληροφορίες σύνδεσης πριν προχωρήσετε.',
        'go_back' => 'Επιστρέψτε και προσπαθήστε ξανά',
    ],
    'make_node' => [
        'name' => 'Εισάγετε ένα σύντομο αναγνωριστικό που χρησιμοποιείται για τη διάκριση αυτού του node από τους υπόλοιπους',
        'description' => 'Εισάγετε μια περιγραφή για την αναγνώριση του node',
        'scheme' => 'Παρακαλώ εισάγετε https για SSL ή http για σύνδεση χωρίς SSL',
        'fqdn' => 'Εισάγετε ένα domain name (π.χ. node.example.com) που θα χρησιμοποιηθεί για τη σύνδεση με το daemon. Μια διεύθυνση IP μπορεί να χρησιμοποιηθεί μόνο εάν δεν χρησιμοποιείτε SSL για αυτόν το node',
        'public' => 'Θα πρέπει αυτό το node να είναι δημόσιο? Ως σημείωση, ορίζοντας ένα node σε ιδιωτικό θα αρνηθείτε τη δυνατότητα auto-deploy σε αυτόν το node.',
        'behind_proxy' => 'Είναι το FQDN σας πίσω από μια proxy?',
        'maintenance_mode' => 'Θα πρέπει να ενεργοποιηθεί η λειτουργία συντήρησης;',
        'memory' => 'Εισάγετε το μέγιστο ποσό μνήμης',
        'memory_overallocate' => 'Εισάγετε το ποσό της μνήμης που θα διατεθεί για over allocation, -1 θα απενεργοποιήσει τον έλεγχο και 0 θα αποτρέψει τη δημιουργία νέων διακομιστών',
        'disk' => 'Εισάγετε το μέγιστο ποσό χώρου στο δίσκο',
        'disk_overallocate' => 'Εισάγετε το ποσό της μνήμης που θα διατεθεί για over allocation, -1 θα απενεργοποιήσει τον έλεγχο και 0 θα αποτρέψει τη δημιουργία νέων διακομιστών',
        'upload_size' => "'Εισάγετε το μέγιστο μέγεθος αρχείου για ανέβασμα",
        'daemonListen' => 'Εισάγετε το daemon listening port',
        'daemonSFTP' => 'Εισάγετε το daemon SFTP listening port',
        'daemonBase' => 'Εισάγετε τον βασικό φάκελο',
        'succes1' => 'Δημιουργήθηκε με επιτυχία ένα νέο node με όνομα: ',
        'succes2' => 'και έχει το αναγνωριστικό: ',
    ],
    'node_config' => [
        'error_not_exist' => 'Το επιλεγμένο node δεν υπάρχει.',
        'error_invalid_format' => 'Καθορίστηκε μη έγκυρη μορφή. Έγκυρες επιλογές είναι yaml και json.',
    ],
    'key_generate' => [
        'error_already_exist' => 'Φαίνεται ότι έχετε ήδη ρυθμίσει ένα application key για κρυπτογράφηση. Συνεχίζοντας με αυτή τη διαδικασία θα κάνετε overwrite το υπάρχον key και αυτό θα προκαλέσει data corruption για τα υπάρχον κρυπτογραφημένα δεδομένα. ΜΗΝ ΣΥΝΕΧΙΣΕΤΕ ΕΑΝ ΔΕΝ ΞΕΡΕΤΕ ΤΙ ΚΑΝΕΤΕ.',
        'understand' => 'Κατανοώ τις συνέπειες της εκτέλεσης αυτής της εντολής και αποδέχομαι κάθε ευθύνη για την απώλεια κρυπτογραφημένων δεδομένων.',
        'continue' => 'Είστε βέβαιοι ότι θέλετε να συνεχίσετε? Αλλάζοντας το encryption key της εφαρμογής ΘΑ ΠΡΟΚΑΛΕΣΕΙ ΑΠΩΛΕΙΑ ΔΕΔΟΜΕΝΩΝ.',
    ],
    'schedule' => [
        'process' => [
            'no_tasks' => 'Δεν υπάρχουν προγραμματισμένες εργασίες για διακομιστές που πρέπει να εκτελεστούν.',
            'error_message' => 'Παρουσιάστηκε σφάλμα κατά την επεξεργασία του Χρονοδιαγράμματος: ',
        ],
    ],
    'upgrade' => [
        'integrity' => 'Αυτή η εντολή δεν επαληθεύει την ακεραιότητα των κατεβασμένων στοιχείων. Βεβαιωθείτε ότι εμπιστεύεστε την πηγή λήψης πριν συνεχίσετε. Εάν δεν επιθυμείτε να κατεβάσετε το αρχείο, παρακαλούμε να το αναφέρετε χρησιμοποιώντας τη σημαία --skip-download, ή απαντώντας "no" στην ερώτηση παρακάτω.',
        'source_url' => 'Πηγή λήψης (ορίστηκε με το --url=):',
        'php_version' => 'Αδυναμία εκτέλεσης διαδικασίας αυτο-αναβάθμισης. Η ελάχιστη απαιτούμενη έκδοση PHP είναι η 7.4.0, έχετε',
        'skipDownload' => 'Θα θέλατε να κατεβάσετε και να αποσυμπιέσετε τα αρχεία για την τελευταία έκδοση?',
        'webserver_user' => 'Ο χρήστης του webserver σας έχει ανιχνευθεί ως <fg=blue>[{:user}]:</> είναι αυτό το σωστό?',
        'name_webserver' => 'Εισάγετε το όνομα του χρήστη που τρέχει στο webserver process σας. Αυτό διαφέρει από σύστημα σε σύστημα, αλλά γενικά είναι "www-data", "nginx", ή "apache".',
        'group_webserver' => 'Το webserver group σας έχει ανιχνευθεί ως <fg=blue>[{:group}]:</> είναι αυτό το σωστό?',
        'group_webserver_question' => 'Εισάγετε το όνομα του group που εκτελεί το webserver process σας. Κανονικά αυτό είναι το ίδιο με το χρήστη σας.',
        'are_your_sure' => 'Είστε βέβαιοι ότι θέλετε να εκτελέσετε τη διαδικασία αναβάθμισης για το panel σας?',
        'terminated' => 'Η διαδικασία αναβάθμισης τερματίστηκε από το χρήστη.',
        'success' => 'Το panel έχει αναβαθμιστεί επιτυχώς. Παρακαλούμε βεβαιωθείτε ότι ενημερώνετε και τα Daemon instances',

    ],
];
