<?php

return [
    'title' => 'Υγεία',
    'results_refreshed' => 'Ο έλεγχος υγείας ενημερώθηκε',
    'checked' => 'Ελεγχθέντα αποτελέσματα από τις :time',
    'refresh' => 'Ανανέωση',
    'results' => [
        'cache' => [
            'label' => 'Προσωρινή μνήμη',
            'ok' => 'Οκ',
            'failed_retrieve' => 'Δεν ήταν δυνατός ο ορισμός ή η ανάκτηση τιμής από την προσωρινή μνήμη της εφαρμογής.',
            'failed' => 'Προέκυψε σφάλμα (exception) στην προσωρινή μνήμη της εφαρμογής: :error',
        ],
        'database' => [
            'label' => 'Βάση δεδομένων',
            'ok' => 'Οκ',
            'failed' => 'Δεν ήταν δυνατή η σύνδεση στη βάση δεδομένων: :error',
        ],
        'debugmode' => [
            'label' => 'Λειτουργία Debug',
            'ok' => 'Η λειτουργία εντοπισμού σφαλμάτων είναι απενεργοποιημένη',
            'failed' => 'Η λειτουργία εντοπισμού σφαλμάτων αναμενόταν να είναι :expected αλλά στην πραγματικότητα ήταν :actual',
        ],
        'environment' => [
            'label' => 'Περιβάλλον',
            'ok' => 'Εντάξει, ορίστηκε σε :actual',
            'failed' => 'Το περιβάλλον έχει οριστεί σε :actual , Αναμενόμενο :expected',
        ],
        'nodeversions' => [
            'label' => 'Εκδόσεις Node',
            'ok' => 'Τα Nodes είναι ενημερωμένα',
            'failed' => ':outdated/:all Τα Nodes δεν είναι ενημερωμένα',
            'no_nodes_created' => 'Δεν δημιουργήθηκαν Nodes',
            'no_nodes' => 'Δεν υπάρχουν Nodes',
            'all_up_to_date' => 'Όλα ενημερωμένα',
            'outdated' => ':outdated/:all δεν είναι ενημερωμένα',
        ],
        'panelversion' => [
            'label' => 'Έκδοση Πίνακα Ελέγχου',
            'ok' => 'Ο πίνακας ελέγχου είναι ενημερωμένος',
            'failed' => 'Η εγκατεστημένη έκδοση είναι :currentVersion αλλά η τελευταία είναι :latestVersion',
            'up_to_date' => 'Ενημερωμένο',
            'outdated' => 'Δεν είναι ενημερωμένο',
        ],
        'schedule' => [
            'label' => 'Πρόγραμμα',
            'ok' => 'Οκ',
            'failed_last_ran' => 'Η τελευταία προγραμματισμένη εκτέλεση του προγράμματος έγινε πριν από :time λεπτά',
            'failed_not_ran' => 'Το πρόγραμμα δεν εκτελέστηκε ακόμα.',
        ],
        'useddiskspace' => [
            'label' => 'Χώρος Δίσκου',
        ],
    ],
    'checks' => [
        'successful' => 'Επιτυχής',
        'failed' => 'Απέτυχε',
    ],
];
