<?php

return [
    'daemon_connection_failed' => 'حدث خطأ أثناء محاولة الاتصال بـ Daemon مما أدى إلى استجابة برمز HTTP/:code. تم تسجيل هذا الاستثناء.',
    'node' => [
        'servers_attached' => 'يجب ألا يكون هناك أي خوادم مرتبطة بهذه العقدة حتى يتم حذفها.',
        'error_connecting' => 'حدث خطأ أثناء الاتصال بـ :node',
        'daemon_off_config_updated' => 'تم <strong>تحديث تكوين Daemon</strong>، ولكن حدث خطأ أثناء محاولة تحديث ملف التكوين تلقائيًا. ستحتاج إلى تحديث ملف التكوين (config.yml) يدويًا ليتم تطبيق هذه التغييرات.',
    ],
    'allocations' => [
        'server_using' => 'تم تعيين خادم حاليًا لهذا التخصيص. لا يمكن حذف التخصيص إلا إذا لم يكن هناك خادم معين له.',
        'too_many_ports' => 'إضافة أكثر من 1000 منفذ في نطاق واحد دفعة واحدة غير مدعومة.',
        'invalid_mapping' => 'التعيين المقدم للمنفذ :port غير صالح ولا يمكن معالجته.',
        'cidr_out_of_range' => 'صيغة CIDR تسمح فقط بالأقنعة بين /25 و /32.',
        'port_out_of_range' => 'يجب أن تكون المنافذ في التخصيص بين 1024 و 65535.',
    ],
    'egg' => [
        'delete_has_servers' => 'لا يمكن حذف بيضة تحتوي على خوادم نشطة من اللوحة.',
        'invalid_copy_id' => 'البيضة المحددة لنسخ السكريبت منها غير موجودة أو تقوم بنسخ سكريبت بنفسها.',
        'has_children' => 'هذه البيضة تحتوي على بيضات فرعية. يرجى حذفها قبل حذف هذه البيضة.',
    ],
    'variables' => [
        'env_not_unique' => 'يجب أن يكون المتغير البيئي :name فريدًا لهذه البيضة.',
        'reserved_name' => 'المتغير البيئي :name محجوز ولا يمكن تعيينه كمتغير.',
        'bad_validation_rule' => 'قاعدة التحقق ":rule" غير صالحة لهذا التطبيق.',
    ],
    'importer' => [
        'json_error' => 'حدث خطأ أثناء تحليل ملف JSON: :error.',
        'file_error' => 'ملف JSON المقدم غير صالح.',
        'invalid_json_provided' => 'ملف JSON المقدم ليس بتنسيق يمكن التعرف عليه.',
    ],
    'subusers' => [
        'editing_self' => 'لا يُسمح بتعديل حساب المستخدم الفرعي الخاص بك.',
        'user_is_owner' => 'لا يمكنك إضافة مالك الخادم كمستخدم فرعي لهذا الخادم.',
        'subuser_exists' => 'المستخدم بعنوان البريد الإلكتروني هذا مضاف بالفعل كمستخدم فرعي لهذا الخادم.',
    ],
    'databases' => [
        'delete_has_databases' => 'لا يمكن حذف مضيف قاعدة بيانات يحتوي على قواعد بيانات نشطة مرتبطة به.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'الحد الأقصى للفاصل الزمني لمهمة متسلسلة هو 15 دقيقة.',
    ],
    'locations' => [
        'has_nodes' => 'لا يمكن حذف موقع يحتوي على عقد نشطة مرتبطة به.',
    ],
    'users' => [
        'is_self' => 'لا يمكنك حذف حسابك الشخصي.',
        'has_servers' => 'لا يمكن حذف مستخدم لديه خوادم نشطة مرتبطة بحسابه. يرجى حذف خوادمه قبل المتابعة.',
        'node_revocation_failed' => 'فشل إلغاء المفاتيح على <a href=":link">العقدة #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'لم يتم العثور على أي عقد تفي بالمتطلبات المحددة للنشر التلقائي.',
        'no_viable_allocations' => 'لم يتم العثور على أي تخصيصات تفي بمتطلبات النشر التلقائي.',
    ],
    'api' => [
        'resource_not_found' => 'المورد المطلوب غير موجود على هذا الخادم.',
    ],
    'mount' => [
        'servers_attached' => 'يجب ألا يكون هناك أي خوادم مرتبطة بهذا التوصيل ليتم حذفه.',
    ],
    'server' => [
        'marked_as_failed' => 'لم يكتمل بعد تثبيت هذا الخادم، يرجى المحاولة مرة أخرى لاحقًا.',
    ],
];
