<?php

return [
    'notices' => [
        'imported' => 'Яйцо и его переменные успешно импортированы.',
        'updated_via_import' => 'Яйцо успешно обновлено из файла.',
        'deleted' => 'Яйцо успешно удалено из панели.',
        'updated' => 'Конфигурация яйца успешно изменена.',
        'script_updated' => 'Скрипт установки яйца был успешно обновлен и будет выполняться при установке серверов.',
        'egg_created' => 'Яйцо успешно создано. Для применения изменений перезагрузите Wings.',
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'Переменная ":variable" удалена, после пересборки серверов она более не будет им доступна.',
            'variable_updated' => 'Переменная ":variable" обновлена. Для применения изменений на серверах необходимо их пересобрать.',
            'variable_created' => 'Новая переменная создана и назначена яйцу успешно.',
        ],
    ],
];
