<?php

return [
    'nav_title' => 'Хранилища',
    'model_label' => 'Хранилище',
    'model_label_plural' => 'Хранилища',
    'name' => 'Название',
    'name_help' => 'Уникальное имя, чтобы отличать эту точку монтирования от других.',
    'source' => 'Источник',
    'source_help' => 'Путь на хосте для монтирования в контейнер.',
    'target' => 'Цель',
    'target_help' => 'Где хранилище будет доступно в контейнере.',
    'read_only' => 'Только чтение?',
    'read_only_help' => 'Монтирование только для чтения в контейнере?',
    'description' => 'Описание',
    'description_help' => 'Более длинное описание для этого монтирования',
    'no_mounts' => 'Монтирования отсутствуют',
    'eggs' => 'Яйца',
    'nodes' => 'Узлы',
    'toggles' => [
        'writable' => 'Изменяемый',
        'read_only' => 'Только чтение',
    ],
    'table' => [
        'name' => 'Название',
        'all_eggs' => 'Все Яйца',
        'all_nodes' => 'Все узлы',
        'read_only' => 'Только чтение',
    ],
];
