<?php

return [
    'nav_title' => 'Пользователи',
    'model_label' => 'Пользователь',
    'model_label_plural' => 'Пользователи',
    'self_delete' => 'Вы не можете удалить самого себя',
    'has_servers' => 'У пользователя есть сервера',
    'email' => 'Почта',
    'username' => 'Имя пользователя',
    'password' => 'Пароль',
    'external_id' => 'Внешний ID',
    'is_managed_externally' => 'Контролируется извне?',
    'is_managed_externally_helper' => 'Если ваши пользователи контролируются внешним программным обеспечением (например, платежной системой), вы можете включить эту опцию, чтобы запретить им изменять логин, электронную почту и пароль прямо в панели управления.',
    'password_help' => 'Указание пароля пользователя необязательно. Если оставить пустым, то при входе пользователя попросит создать пароль.',
    'admin_roles' => 'Роли администратора',
    'roles' => 'Роли',
    'no_roles' => 'Нет ролей',
    'servers' => 'Сервера',
    'subusers' => 'Субпользователи',
    'password_reset' => 'Сбросить пароль',
    'password_reset_sent' => 'Письмо для сброса пароля отправлено',
    'password_reset_failed' => 'Не удалось отправить письмо для сброса пароля',
];
