<?php

return [
    'user' => [
        'search_users' => 'Увядзіце імя карыстальніка, ID карыстальніка або адрас пошты',
        'select_search_user' => 'ID карыстальніка для выдалення (увядзіце \'0\' для паўторнага пошуку)',
        'deleted' => 'Карыстальнік паспяхова выдалены з панэлі.',
        'confirm_delete' => 'Вы ўпэўнены, што хочаце выдаліць гэтага карыстальніка з панэлі?',
        'no_users_found' => 'Карыстальнікі не знойдзены па дадзеным пошукавым тэрміне.',
        'multiple_found' => 'Знойдзена некалькі ўліковых запісаў для гэтага карыстальніка, нельга выдаліць карыстальніка з-за флага --no-interaction.',
        'ask_admin' => 'Ці з\'яўляецца гэты карыстальнік адміністратарам?',
        'ask_email' => 'Адрас пошты',
        'ask_username' => 'Ідэнтыфікатар карыстальніка',
        'ask_password' => 'Пароль',
        'ask_password_tip' => 'Калі вы хочаце стварыць уліковы запіс з выпадковым паролем, які будзе адпраўлены карыстальніку па пошце, паўторна запусціце гэтую каманду (CTRL+C) і дадайце флаг `--no-password`.',
        'ask_password_help' => 'Паролі павінны складацца як мінімум з 8 сімвалаў і ўтрымліваць хаця б адну вялікую літару і лічбу.',
        '2fa_help_text' => [
            'Гэтая каманда адключыць двухфактарную аўтэнтыфікацыю для ўліковага запісу карыстальніка, калі яна ўключана. Гэта павінна выкарыстоўвацца толькі як каманда аднаўлення ўліковага запісу, калі карыстальнік заблакаваў доступ.',
            'Калі гэта не тое, што вы хацелі зрабіць, націсніце CTRL+C, каб выйсці з гэтага працэсу.',
        ],
        '2fa_disabled' => 'Двухфактарная аўтэнтыфікацыя была адключана для :email.',
    ],
    'schedule' => [
        'output_line' => 'Адпраўка працы для першай задачы ў `:schedule` (:id).',
    ],
    'maintenance' => [
        'deleting_service_backup' => 'Выдаленне файла рэзервовай копіі сэрвісу.',
    ],
    'server' => [
        'rebuild_failed' => 'Запыт на аднаўленне для ":name" (#:id) на вузле ":node" не ўдалося з памылкай: :message',
        'reinstall' => [
            'failed' => 'Запыт на пераўсталёўку для ":name" (#:id) на вузле ":node" не ўдалося з памылкай: :message',
            'confirm' => 'Вы збіраецеся пераўсталяваць групу сервераў. Ці хочаце працягнуць?',
        ],
        'power' => [
            'confirm' => 'Вы збіраецеся выканаць дзеянне :action супраць :count сервераў. Ці хочаце працягнуць?',
            'action_failed' => 'Запыт на дзеянне ўключэння/выключэння для "name" (#:id) на вузле ":node" не ўдалося з памылкай: :message',
        ],
    ],
    'environment' => [
        'mail' => [
            'ask_smtp_host' => 'SMTP хост (напрыклад: smtp.gmail.com)',
            'ask_smtp_port' => 'SMTP порт',
            'ask_smtp_username' => 'SMTP імя карыстальніка',
            'ask_smtp_password' => 'SMTP пароль',
            'ask_mailgun_domain' => 'Дамен Mailgun',
            'ask_mailgun_endpoint' => 'Кантэйнер Mailgun',
            'ask_mailgun_secret' => 'Сакрэт Mailgun',
            'ask_mandrill_secret' => 'Сакрэт Mandrill',
            'ask_postmark_username' => 'API ключ Postmark',
            'ask_driver' => 'Які драйвер павінен выкарыстоўвацца для адпраўкі электронных лістоў?',
            'ask_mail_from' => 'Адрас электроннай пошты, з якога павінны паступаць лісты',
            'ask_mail_name' => 'Імя, з якога павінны паступаць лісты',
            'ask_encryption' => 'Метад шыфравання для выкарыстання',
        ],
    ],
];
