<?php

return [
    'notices' => [
        'imported' => 'この卵と関連する変数を正常にインポートしました。',
        'updated_via_import' => '指定されたファイルを使用してこの卵を更新しました。',
        'deleted' => '要求された卵をパネルから削除しました。',
        'updated' => '卵の設定が更新されました。',
        'script_updated' => 'Eggのインストールスクリプトが更新され、サーバーがインストールされるたびに実行されます。',
        'egg_created' => '新しい卵が生成されました。この新しい卵を適用するには、実行中のデーモンを再起動する必要があります。',
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => '変数 ":variable" が削除され、再構築されると、サーバーで使用できなくなります。',
            'variable_updated' => '変数 ":variable" が更新されました。変更を適用するには、この変数を使用しているサーバーを再構築する必要があります。',
            'variable_created' => '新しい変数が作成され、この卵に割り当てられました。',
        ],
    ],
];
