<?php

return [
    'nav_title' => 'Пользователи',
    'model_label' => 'Пользователь',
    'model_label_plural' => 'Пользователи',
    'self_delete' => 'Вы не можете удалить самого себя',
    'has_servers' => 'У пользователя есть сервера',
    'email' => 'Почта',
    'username' => 'Имя пользователя',
    'password' => 'Пароль',
    'password_help' => 'Указание пароля пользователя необязательно. Если оставить пустым, то при входе пользователя попросит создать пароль.',
    'admin_roles' => 'Роли администратора',
    'roles' => 'Роли',
    'no_roles' => 'Нет ролей',
    'servers' => 'Сервера',
    'subusers' => 'Субпользователи',
];
