<?php

return [
    'title' => 'סקירה כללית של החשבון',
    'email' => [
        'title' => 'עדכנו את הדואר האלקטרוני שלכם',
        'button' => 'עדכן דוא"ל',
        'updated' => 'כתובת הדוא"ל התעדכנה.',
    ],
    'password' => [
        'title' => 'שנה את סיסמתך',
        'button' => 'עדכן סיסמה',
        'requirements' => 'הסיסמה החדשה שלך צריכה להיות באורך של לפחות 8 תווים.',
        'validation' => [
            'account_password' => 'עליך לספק את סיסמת החשבון שלך.',
            'current_password' => 'עליך לספק את הסיסמה הנוכחית שלך.',
            'password_confirmation' => 'אישור הסיסמה אינו תואם לסיסמה שהזנת.',
        ],
        'updated' => 'הסיסמא שלך עודכנה.',
    ],
    'two_factor' => [
        'title' => 'אימות דו-שלבי',
        'button' => 'הגדר אימות דו-שלבי',
        'disabled' => 'אימות דו-שלבי הושבת בחשבונך. לא תתבקש יותר לספק אסימון בעת הכניסה.',
        'enabled' => 'אימות דו-שלבי הופעל בחשבון שלך! מעתה, בעת הכניסה, תידרש לספק את הקוד שנוצר על ידי המכשיר שלך.',
        'invalid' => 'הטוקן שסופק היה לא חוקי.',
        'enable' => [
            'help' => 'כרגע לא מופעל בחשבון שלך אימות דו-שלבי. לחץ על הכפתור למטה כדי להתחיל להגדיר אותו.',
            'button' => 'הפעל אימות דו-שלבי',
        ],
        'disable' => [
            'help' => 'אימות דו-שלבי כרגע מופעל בחשבון שלך.',
            'title' => 'השבת אימות דו-שלבי',
            'field' => 'הזן טוקן',
            'button' => 'בטל אימות דו-שלבי',
        ],
        'setup' => [
            'title' => 'הגדר אימות דו-שלבי',
            'subtitle' => "עזור להגן על החשבון שלך מפני גישה לא מורשית. תתבקש לבצע קוד אימות בכל פעם שתיכנס.",
            'help' => 'לא מצליחים לסרוק את הקוד? הזן את הקוד למטה באפליקציה שלך:',
        ],

        'required' => [
            'title' => 'נדרש אימות דו-שלבי',
            'description' => 'אימות דו-שלבי חייב להיות מופעל בחשבון שלך כדי להמשיך.',
        ],
    ],
];
