<?php

return [
    'email' => [
        'title' => 'עדכנו את הדואר האלקטרוני שלכם',
        'updated' => 'כתובת הדוא"ל התעדכנה.',
    ],
    'password' => [
        'title' => 'שנה את סיסמתך',
        'requirements' => 'הסיסמה החדשה שלך צריכה להיות באורך של לפחות 8 תווים.',
        'updated' => 'הסיסמא שלך עודכנה.',
    ],
    'two_factor' => [
        'button' => 'הגדר אימות דו-שלבי',
        'disabled' => 'אימות דו-שלבי הושבת בחשבונך. לא תתבקש יותר לספק אסימון בעת הכניסה.',
        'enabled' => 'אימות דו-שלבי הופעל בחשבון שלך! מעתה, בעת הכניסה, תידרש לספק את הקוד שנוצר על ידי המכשיר שלך.',
        'invalid' => 'הטוקן שסופק היה לא חוקי.',
        'setup' => [
            'title' => 'הגדר אימות דו-שלבי',
            'help' => 'לא מצליחים לסרוק את הקוד? הזן את הקוד למטה באפליקציה שלך:',
            'field' => 'הזן טוקן',
        ],
        'disable' => [
            'title' => 'השבת אימות דו-שלבי',
            'field' => 'הזן טוקן',
        ],
    ],
];
