<?php

return [
    'appsettings' => [
        'comment' => [
            'author' => 'Вкажіть адресу електронної пошти, яка буде використовуватися для експортованих яєць у цій панелі. Це повинна бути дійсна електронна адреса.',
            'url' => 'URL застосунку МАЄ починатися з https:// або http://, залежно від того, чи використовуєте ви SSL. Якщо не включити схему, ваші електронні листи та інший контент будуть містити некоректні посилання.',
            'timezone' => 'Часовий пояс має відповідати одному із підтримуваних часових поясів PHP. Якщо ви не впевнені, зверніться за посиланням: https://php.net/manual/en/timezones.php.',
        ],
        'redis' => [
            'note' => 'Ви вибрали драйвер Redis для одного або кількох параметрів. Будь ласка, надайте дійсну інформацію для підключення. У більшості випадків можна використовувати значення за замовчуванням, якщо ви не змінювали конфігурацію.',
            'comment' => 'За замовчуванням сервер Redis використовує ім’я користувача "default" і не має пароля, оскільки він працює локально і недоступний зовні. Якщо це ваш випадок, просто натисніть Enter без введення значення.',
            'confirm' => 'Здається, параметр :field уже визначено для Redis. Ви хочете змінити його?',
        ],
    ],
    'database_settings' => [
        'DB_HOST_note' => 'Настійно рекомендується не використовувати "localhost" як хост бази даних, оскільки це часто призводить до проблем із підключенням через сокети. Для локального підключення слід використовувати "127.0.0.1".',
        'DB_USERNAME_note' => 'Використання root-акаунта для підключення до MySQL не тільки не рекомендується, але й заборонене цим застосунком. Вам потрібно створити окремого користувача MySQL для цієї програми.',
        'DB_PASSWORD_note' => 'Здається, у вас уже є пароль підключення до MySQL. Ви хочете змінити його?',
        'DB_error_2' => 'Ваші облікові дані НЕ було збережено. Вам потрібно вказати коректну інформацію для підключення перед продовженням.',
        'go_back' => 'Повернутися назад і спробувати ще раз',
    ],
    'make_node' => [
        'name' => 'Введіть короткий ідентифікатор для розрізнення цього вузла від інших',
        'description' => 'Введіть опис для ідентифікації вузла',
        'scheme' => 'Вкажіть https для SSL або http для незахищеного з’єднання',
        'fqdn' => 'Введіть доменне ім\'я (наприклад, node.example.com) для підключення до Daemon. IP-адреса може використовуватися тільки якщо SSL не використовується.',
        'public' => 'Чи повинен цей вузол бути публічним? Якщо вузол є приватним, можливість автоматичного розгортання на ньому буде вимкнена.',
        'behind_proxy' => 'Чи ваш FQDN розташований за проксі?',
        'maintenance_mode' => 'Увімкнути режим обслуговування?',
        'memory' => 'Вкажіть максимальний обсяг оперативної пам’яті',
        'memory_overallocate' => 'Вкажіть обсяг перевиділення пам’яті, -1 вимкне перевірку, 0 заборонить створення нових серверів',
        'disk' => 'Вкажіть максимальний обсяг дискового простору',
        'disk_overallocate' => 'Вкажіть обсяг перевиділення диска, -1 вимкне перевірку, 0 заборонить створення нових серверів',
        'cpu' => 'Вкажіть максимальне використання CPU',
        'cpu_overallocate' => 'Вкажіть обсяг перевиділення CPU, -1 вимкне перевірку, 0 заборонить створення нових серверів',
        'upload_size' => 'Вкажіть максимальний розмір файлу для завантаження',
        'daemonListen' => 'Вкажіть порт прослуховування Daemon',
        'daemonConnect' => 'Введіть порт підключення демона (може бути таким же, як порт прослуховування)',
        'daemonSFTP' => 'Вкажіть порт SFTP Daemon',
        'daemonSFTPAlias' => 'Вкажіть псевдонім SFTP Daemon (може бути порожнім)',
        'daemonBase' => 'Вкажіть базовий каталог',
        'success' => 'Успішно створено вузол з назвою :name та ідентифікатором :id',
    ],
    'node_config' => [
        'error_not_exist' => 'Вибраний вузол не існує.',
        'error_invalid_format' => 'Вказано невірний формат. Доступні варіанти: yaml і json.',
    ],
    'key_generate' => [
        'error_already_exist' => 'Здається, у вас уже налаштовано ключ шифрування застосунку. Продовження цього процесу перезапише ключ і може спричинити втрату зашифрованих даних. НЕ ПРОДОВЖУЙТЕ, ЯКЩО НЕ РОЗУМІЄТЕ НАСЛІДКІВ.',
        'understand' => 'Я розумію наслідки виконання цієї команди та беру на себе відповідальність за можливу втрату зашифрованих даних.',
        'continue' => 'Ви впевнені, що хочете продовжити? Зміна ключа шифрування застосунку ПРИЗВЕДЕ ДО ВТРАТИ ДАНИХ.',
    ],
    'schedule' => [
        'process' => [
            'no_tasks' => 'Немає запланованих завдань для серверів, які потрібно виконати.',
            'error_message' => 'Під час обробки розкладу виникла помилка: ',
        ],
    ],
];
