<?php

return [
    'title' => 'Преглед на акаунта',
    'email' => [
        'title' => 'Смени имейл адрес',
        'button' => 'Смени имейл',
        'updated' => 'Твоят главен имейл бе актуализиран.',
    ],
    'password' => [
        'title' => 'Смени парола',
        'button' => 'Смени парола',
        'requirements' => 'Твоята нова парола трябва да е поне 8 знака дълга и да е единствена за този уебсайт.',
        'validation' => [
            'account_password' => 'Трябва да предоставиш паролата за акаунта ти.',
            'current_password' => 'Трябва да предоставиш текущата ти парола.',
            'password_confirmation' => 'Password confirmation does not match the password you entered.',
        ],
        'updated' => 'Твоята парола бе актуализирана.',
    ],
    'two_factor' => [
        'title' => 'Дву-факторно удостоверяване',
        'button' => 'Конфигурирай дву-факторно удостоверяване',
        'disabled' => 'Дву-факторно удостоверяване бе изключено за твоя акаунт. Вече не трябва да въвеждаш токен когато влизаш.',
        'enabled' => 'Дву-факторно удостоверяване бе включено за акаунта ти! От сега, когато се вписваш ще трябва да въвеждаш кода създаден от устройството ти.',
        'invalid' => 'Токена който предостави е невалиден.',
        'enable' => [
            'help' => 'В момента нямаш дву-факторно удостоверяване активирано на акаунта ти. Натисни бутона от долу за да започнеш да го конфигурираш.',
            'button' => 'Активирай дву-факторно удостоверяване',
        ],
        'disable' => [
            'help' => 'Дву-факторно удостоверяване е активирано за акаунта ти.',
            'title' => 'Деактивирай дву-факторно удостоверяване',
            'field' => 'Въведи токен',
            'button' => 'Деактивирай дву-факторно удостоверяване',
        ],
        'setup' => [
            'title' => 'Активирай дву-факторно удостоверяване',
            'subtitle' => "Help protect your account from unauthorized access. You'll be prompted for a verification code each time you sign in.",
            'help' => 'Scan the QR code above using the two-step authentication app of your choice. Then, enter the 6-digit code generated into the field below.',
        ],

        'required' => [
            'title' => 'Нужно е дву-факторно удостоверяване',
            'description' => 'Твоят акаунт трябва да има дву-факторно удостоверяване за да продължиш.',
        ],
    ],
];
