<?php

return [
    'title' => 'Табло',
    'showing-your-servers' => 'Показване на вашите сървъри',
    'showing-others-servers' => 'Показване на чужди сървъри',
    'no-other-servers' => 'Няма други сървъри за показване.',
    'no-servers-associated' => 'Няма сървъри свързани с твоят акаунт',

    'content_tabs' => 'Раздели със съдържание',
    'overview' => 'Преглед',
    'heading' => 'Добре дошъл в Pelican!',
    'expand_sections' => 'Можеш да разшириш следните секции',
    'sections' => [
        'intro-developers' => [
            'heading' => 'Информация за разработчици',
            'content' => 'Благодарим ви че изпробвате версията за разработка!',
            'extra_note' => 'Ако намерите някакви проблеми моля, докладвайте ги в GitHub.',
            'button_issues' => 'Създай проблем',
            'button_features' => 'Обсъждане на характеристиките',
        ],
        'intro-first-node' => [
            'heading' => 'Не са намерени node-ове',
            'content' => 'Изглежда че нямаш конфигурирани node-ове но не се притеснявай, защото можеш да натиснеш бутона за действие да създадеш първия си node.',
            'extra_note' => 'Ако намерите някакви проблеми моля, докладвайте ги в GitHub.',
            'button_label' => 'Създай първия си node в Pelican',
        ],
        'intro-support' => [
            'heading' => 'Подкрепете Pelican',
            'content' => 'Благодарим ви че използваш Pelican, Това можеше да се случи само чрез твойта подкрепа, на нашите сътрудници и останалите ни поддръжници!',
            'extra_note' => 'Оценяваме каквато и да е подкрепа от всеки.',
            'button_translate' => 'Помогни с превеждане',
            'button_donate' => 'Дари директно',
        ],
        'intro-help' => [
            'heading' => 'Трябва ти помощ?',
            'content' => 'Погледни документацията първо! Ако още ти е нужна помощ, отиди в нашият Discord сървър!',
            'button_docs' => 'Прочети документацията',
            'button_discord' => 'Получи помощ в нашият Discord',
        ],
    ],

    'search' => 'Търси сървъри...',
    'no_matches' => 'Не бяха намерени сървъри с зададената ключова дума.',
    'cpu_title' => 'Процесор',
    'memory_title' => 'Памет',
];
