<?php

return [
    'daemon_connection_failed' => 'Υπήρξε ένα exception κατά την προσπάθεια επικοινωνίας με το daemon με αποτέλεσμα να υπάρχει κωδικός απόκρισης HTTP/:code. Αυτή η εξαίρεση έχει καταγραφεί.',
    'node' => [
        'servers_attached' => 'Ένας κόμβος δεν πρέπει να έχει διακομιστές συνδεδεμένους με αυτόν για να διαγραφτεί.',
        'error_connecting' => 'Σφάλμα σύνδεσης σε :node',
        'daemon_off_config_updated' => 'Η ρύθμιση παραμέτρων daemon <strong>έχει ενημερωθεί</strong>, Ωστόσο, υπήρξε ένα σφάλμα κατά την προσπάθεια αυτόματης ενημέρωσης του αρχείου ρυθμίσεων στο daemon. Θα χρειαστεί να ενημερώσετε χειροκίνητα το αρχείο ρυθμίσεων (config.yml) για το daemon ώστε να εφαρμοστούν αυτές οι αλλαγές.',
    ],
    'allocations' => [
        'server_using' => 'Ένας διακομιστής έχει ανατεθεί σε αυτήν την κατανομή. Μια κατανομή μπορεί να διαγραφτεί μόνο αν δεν έχει οριστεί κανένας διακομιστής για αυτήν.',
        'too_many_ports' => 'Η προσθήκη περισσότερων από 1000 θυρών σε ένα εύρος ταυτόχρονα δεν υποστηρίζεται.',
        'invalid_mapping' => 'Η χαρτογράφηση που παρέχεται για :port ήταν άκυρη και δεν μπόρεσε να υποβληθεί σε επεξεργασία.',
        'cidr_out_of_range' => 'Η ένδειξη CIDR επιτρέπει μόνο μάσκες μεταξύ /25 και /32.',
        'port_out_of_range' => 'Οι θύρες σε μια κατανομή πρέπει να είναι μεγαλύτεροι από 1024 και μικρότεροι ή ίσοι με 65535.',
    ],
    'egg' => [
        'delete_has_servers' => 'Ένα Αυγό με ενεργούς διακομιστές που είναι συνδεδεμένοι σε αυτό δεν μπορεί να διαγραφτεί από τον πίνακα.',
        'invalid_copy_id' => 'Το Αυγό που επιλέχθηκε για την αντιγραφή ενός σεναρίου είτε δεν υπάρχει ή αντιγράφει το ίδιο το σενάριο.',
        'has_children' => 'Αυτό το Αυγό είναι γονέας σε ένα ή περισσότερα άλλα Αυγά. Παρακαλώ διαγράψτε αυτά τα Αυγά πριν διαγράψετε αυτό το συγκεκριμένο αυγό.',
    ],
    'variables' => [
        'env_not_unique' => 'Η μεταβλητή περιβάλλοντος :name πρέπει να είναι μοναδική σε αυτό το Αυγό.',
        'reserved_name' => 'Η μεταβλητή περιβάλλοντος :name προστατεύεται και δεν μπορεί να ανατεθεί σε μια μεταβλητή.',
        'bad_validation_rule' => 'Ο κανόνας επικύρωσης ":rule" δεν είναι έγκυρος κανόνας για αυτήν την εφαρμογή.',
    ],
    'importer' => [
        'json_error' => 'Παρουσιάστηκε σφάλμα κατά την προσπάθεια ανάλυσης του αρχείου JSON: :error.',
        'file_error' => 'Το παρεχόμενο αρχείο JSON δεν ήταν έγκυρο.',
        'invalid_json_provided' => 'Το αρχείο JSON που παρέχεται δεν είναι σε μορφή που μπορεί να αναγνωριστεί.',
    ],
    'subusers' => [
        'editing_self' => 'Η επεξεργασία του δικού σας χρήστη δεν επιτρέπεται.',
        'user_is_owner' => 'Δεν μπορείτε να προσθέσετε τον ιδιοκτήτη του διακομιστή ως χρήστη σε αυτόν το διακομιστή.',
        'subuser_exists' => 'Ένας χρήστης με αυτή τη διεύθυνση ηλεκτρονικού ταχυδρομείου έχει ήδη αντιστοιχιστεί ως υποχρήστης για αυτόν τον διακομιστή.',
    ],
    'databases' => [
        'delete_has_databases' => 'Δεν είναι δυνατή η διαγραφή ενός διακομιστή βάσης δεδομένων που έχει ενεργές βάσεις δεδομένων συνδεδεμένες με αυτόν.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Το μέγιστο χρονικό διάστημα για μια αλυσοδεμένη εργασία είναι 15 λεπτά.',
    ],
    'locations' => [
        'has_nodes' => 'Δεν είναι δυνατή η διαγραφή μιας τοποθεσίας που έχει συνδεδεμένους ενεργούς κόμβους.',
    ],
    'users' => [
        'is_self' => 'Δεν μπορείτε να διαγράψετε το δικό σας λογαριασμό χρήστη.',
        'has_servers' => 'Δεν είναι δυνατή η διαγραφή ενός χρήστη με ενεργούς διακομιστές συνδεδεμένους στον λογαριασμό του. Παρακαλούμε διαγράψτε τους διακομιστές του πριν συνεχίσετε.',
        'node_revocation_failed' => 'Αποτυχία ανάκλησης κλειδιών στον κόμβο <a href=":link">#:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'Δεν βρέθηκαν κόμβοι που να ικανοποιούν τις απαιτήσεις που καθορίζονται για την αυτόματη ανάπτυξη.',
        'no_viable_allocations' => 'Δεν βρέθηκαν allocations που να ικανοποιούν τις απαιτήσεις για αυτόματη ανάπτυξη.',
    ],
    'api' => [
        'resource_not_found' => 'Ο πόρος που ζητήθηκε δεν υπάρχει σε αυτόν το διακομιστή.',
    ],
    'mount' => [
        'servers_attached' => 'Ένας κόμβος δεν πρέπει να έχει διακομιστές συνδεδεμένους με αυτόν για να διαγραφτεί.',
    ],
    'server' => [
        'marked_as_failed' => 'Αυτός ο διακομιστής δεν έχει ολοκληρώσει ακόμη τη διαδικασία εγκατάστασης, παρακαλώ προσπαθήστε ξανά αργότερα.',
    ],
];
