<?php

return [
    'title' => 'النسخ الاحتياطية',
    'empty' => 'لا توجد نسخ احتياطية',
    'size' => 'الحجم',
    'created_at' => 'تاريخ الانشاء',
    'status' => 'الحالة',
    'is_locked' => 'حالة القفل',
    'backup_status' => [
        'in_progress' => 'جار المعالجة',
        'successful' => 'ناجح',
        'failed' => 'فشل',
    ],
    'actions' => [
        'create' => [
            'title' => 'إنشاء نسخة احتياطية',
            'limit' => 'تم الوصول إلى حد النسخ الاحتياطي',
            'created' => 'تم إنشاء :name',
            'notification_success' => 'تم إنشاء النسخة الاحتياطية بنجاح',
            'notification_fail' => 'فشل إنشاء النسخة الاحتياطية',
            'name' => 'الاسم',
            'ignored' => 'الملفات والمجلدات المتجاهلة',
            'locked' => 'مقفل؟',
            'lock_helper' => 'منع حذف هذه النسخة الاحتياطية حتى يتم إلغاء قفلها.',
        ],
        'lock' => [
            'lock' => 'قفل',
            'unlock' => 'فتح القفل',
        ],
        'download' => 'تحميل',
        'rename' => [
            'title' => 'إعادة تسمية',
            'new_name' => 'اسم النسخة الاحتياطية',
            'notification_success' => 'تم إعادة تسمية النسخة الاحتياطية بنجاح',
        ],
        'restore' => [
            'title' => 'استعادة',
            'helper' => 'سيتم إيقاف الخادم الخاص بك. لن تتمكن من التحكم في حالة الطاقة، أو الوصول إلى مدير الملفات، أو إنشاء نسخ احتياطية إضافية حتى تكتمل هذه العملية.',
            'delete_all' => 'حذف جميع الملفات قبل استعادة النسخة الاحتياطية؟',
            'notification_started' => 'جار استعادة النسخة الاحتياطية',
            'notification_success' => 'تم استعادة النسخة الاحتياطية بنجاح',
            'notification_fail' => 'فشل استعادة النسخة الاحتياطية',
            'notification_fail_body_1' => 'هذا الخادم ليس حاليا في حالة تسمح باستعادة النسخة الاحتياطية.',
            'notification_fail_body_2' => 'لا يمكن استعادة هذه النسخة الاحتياطية في هذا الوقت: لم تكتمل أو فشل.',
        ],
        'delete' => [
            'title' => 'حذف النسخة الاحتياطية',
            'description' => 'هل ترغب في حذف :backup؟',
            'notification_success' => 'تم حذف النسخة الاحتياطية',
            'notification_fail' => 'تعذر حذف النسخة الاحتياطية',
            'notification_fail_body' => 'فشل الاتصال بالعقدة. الرجاء المحاولة مرة أخرى.',
        ],
    ],
];
