<?php

return [
    'notices' => [
        'imported' => 'ביצה זו והמשתנים הקשורים לה יובאו בהצלחה.',
        'updated_via_import' => 'ביצה זו עודכנה באמצעות הקובץ שסופק.',
        'deleted' => 'נמחקה בהצלחה הביצה המבוקשת מהחלונית.',
        'updated' => 'תצורת הביצה עודכנה בהצלחה.',
        'script_updated' => 'סקריפט התקנת הביצה עודכן ויפעל בכל פעם שיותקנו שרתים.',
        'egg_created' => 'ביצה חדשה הוטלה בהצלחה. תצטרך להפעיל מחדש את כל הדמונים הפועלים כדי להחיל את התיקון החדש הזה.',
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'המשתנה ":variable" נמחק ולא יהיה זמין יותר לשרתים לאחר הבנייה מחדש.',
            'variable_updated' => 'המשתנה ":variable" עודכן. תצטרך לבנות מחדש את כל השרתים המשתמשים במשתנה זה כדי להחיל שינויים.',
            'variable_created' => 'משתנה חדש נוצר בהצלחה והוקצה לביצה זו.',
        ],
    ],
];
