<?php

return [
    'notices' => [
        'imported' => 'ביצה זו והמשתנים הקשורים לה יובאו בהצלחה.',
        'updated_via_import' => 'ביצה זו עודכנה באמצעות הקובץ שסופק.',
        'deleted' => 'נמחקה בהצלחה הביצה המבוקשת מהחלונית.',
        'updated' => 'תצורת הביצה עודכנה בהצלחה.',
        'script_updated' => 'סקריפט התקנת הביצה עודכן ויפעל בכל פעם שיותקנו שרתים.',
        'egg_created' => 'ביצה חדשה הוטלה בהצלחה. תצטרך להפעיל מחדש את כל הדמונים הפועלים כדי להחיל את התיקון החדש הזה.',
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'המשתנה ":variable" נמחק ולא יהיה זמין יותר לשרתים לאחר הבנייה מחדש.',
            'variable_updated' => 'המשתנה ":variable" עודכן. תצטרך לבנות מחדש את כל השרתים המשתמשים במשתנה זה כדי להחיל שינויים.',
            'variable_created' => 'משתנה חדש נוצר בהצלחה והוקצה לביצה זו.',
        ],
    ],
    'descriptions' => [
        'name' => 'שם פשוט וקריא לבני אדם לשימוש כמזהה עבור ביצה זו.',
        'description' => 'תיאור של ביצה זו שיוצג בכל הפאנל לפי הצורך.',
        'uuid' => 'זהו המזהה הייחודי העולמי עבור ביצה זו אשר Wings משתמשת בו כמזהה.',
        'author' => 'היוצר של גרסה זו של הביצה. העלאת תצורת ביצה חדשה מתצורה של יוצר אחר תשנה את זה.',
        'force_outgoing_ip' => "מאלץ את כל תעבורת הרשת היוצאת לקשר את כתובת ה-IP של המקור לכתובת ה- IP של ההקצאה הראשית של השרת.\nנדרש כדי שמשחקים מסוימים יפעלו כראוי כאשר לצומת יש כתובות IP ציבוריות מרובות.\nהפעלת אפשרות זו תשבית רשת פנימית עבור כל השרתים המשתמשים בביצה הזאת, מה שגורם להם לא להיות מסוגלים לגשת באופן פנימי לשרתים אחרים באותו צומת.",
        'startup' => 'פקודת ההפעלה המוגדרת כברירת מחדל שיש להשתמש בה עבור שרתים חדשים המשתמשים בביצה זו.',
        'docker_images' => 'תמונות Docker הזמינות לשרתים המשתמשים בביצה זו.',
    ],
];
