<?php

return [
    'exceptions' => [
        'user_has_servers' => 'לא ניתן למחוק משתמש עם שרתים פעילים המחוברים לחשבון שלו. נא למחוק את השרתים שלהם לפני שתמשיך.',
        'user_is_self' => 'לא ניתן למחוק את חשבון המשתמש שלך.',
    ],
    'notices' => [
        'account_created' => 'החשבון נוצר בהצלחה.',
        'account_updated' => 'החשבון עודכן בהצלחה.',
    ],
    'last_admin' => [
        'hint' => 'זהו מנהל הבסיס האחרון!',
        'helper_text' => 'דרוש לך לפחות מנהל בסיס אחד במערכת שלך.',
    ],
    'root_admin' => 'מנהל מערכת (בסיס)',
    'language' => [
        'helper_text1' => 'השפה שלך (:state) עוד לא תורגם!\nאל חשש, תוכל לתקן את זה על ידי',
        'helper_text2' => 'תורמים כאן ישירות',
    ],
];
